{
    "'NBLT working to maintain Bald Mountain', Citizen's Voice, The & Sunday Voice (online), 1 Oct 2017\n‹https://infoweb.newsbank.com/apps/news/document-view?p=WORLDNEWS&docref=news/167438294894E258›\n": " \"I was told it was called Bald Mountain because in the past they would burn the top off — making it appear bald — so the blueberry bushes would thrive,\" said Charlene Wildes, North Branch Land Trust volunteer naturalist. And thrive they have, a low, sprawling counterpoint to the gigantic alien-looking wind turbines that make up the Bear Creek Wind Farm at the very top of Bald Mountain in Bear Creek Township. A unique combination of the natural — and a view of technology that harnesses the natural to provide clean energy — greeted trekkers on a recent hike of Bald Mountain, a unique nature preserve. The hillside preserve stretches from Bear Creek Camp to near the top of the mountain, where the privately owned Bear Creek turbines spin, and which is privately owned and not open to hikers or sightseers. But looking at the turbines even from a distance makes you realize just how massive these whirring sentinels are. Seventeen hardy souls took on the three-mile hike that was sponsored by the North Branch Land Trust, which is helping to keep Bald Mountain pristine by preserving a large tract of it. Starting in 2011, NBLT worked with the landowners and others to preserve the property. They secured funding for the purchase from a Pennsylvania Department of Conservation and Natural Resources Program Grant and in 2013 the 385-acre Bald Mountain Preserve on the East Mountain came into being. \"North Branch Land Trust conserved a 385-acre portion of Bald Mountain in 2013 and transferred the property to Natural Lands Trust that same year,\" said Paul Lumia, NBLT Executive Director. \"Bald Mountain is a unique natural area in that it straddles two significate watersheds, the Delaware watershed to the east and the Susquehanna watershed to the west. The mountain also harbors a globally rare scrub oak barrens habitat that is invaluable to wildlife at local and landscape scales.\" So now, Lumia said, \"When you're driving on the Cross-Valley Expressway and you look up at the windmills, you know all that property below the windmills is protected.\" The rugged terrain of this mountain is largely forested. Dominant species include red oak, white oak and red maple. Two state-designated \"high quality\" streams flow through the property, bordered by native hemlocks and aspens. And the trail abuts a large glacial bog that is home to several rare and carnivorous plants. Wildlife abounds, from the chattering of migratory songbirds — such as scarlet tanagers, Eastern towhees and hermit thrushes — to black bears, bald eagles and the red eft (salamander) that charmed folks on Sunday. The walk left hikers feeling inspired. Sue Lenahan of Penn Lake said that \"it's very exciting to have opportunities to explore wonderful new places like this. I'm very happy NBLT is sponsoring these hikes.\" \"Today was a reminder of how fortunate we are to live in this area,\" said Debb Krysicki, also of Penn Lake. \"The hike with good people and company, the size of the turbines and the picturesque view of the nearby towns in the distance provided a great experience.\" October 1, 2017 | Citizen's Voice, The & Sunday Voice (Wilkes-Barre, PA) Section: Sports  555 Words OpenURL Link  \"I was told it was called Bald Mountain because in the past they would burn the top off — making it appear bald — so the blueberry bushes would thrive,\" said Charlene Wildes, North Branch Land Trust volunteer naturalist. And thrive they have, a low, sprawling counterpoint to the gigantic alien-looking wind turbines that make up the Bear Creek Wind Farm at the very top of Bald Mountain in Bear Creek Township. A unique combination of the natural — and a view of technology that harnesses the natural to provide clean energy — greeted trekkers on a recent hike of Bald Mountain, a unique nature preserve. The hillside preserve stretches from Bear Creek Camp to near the top of the mountain, where the privately owned Bear Creek turbines spin, and which is privately owned and not open to hikers or sightseers. But looking at the turbines even from a distance makes you realize just how massive these whirring sentinels are. Seventeen hardy souls took on the three-mile hike that was sponsored by the North Branch Land Trust, which is helping to keep Bald Mountain pristine by preserving a large tract of it. Starting in 2011, NBLT worked with the landowners and others to preserve the property. They secured funding for the purchase from a Pennsylvania Department of Conservation and Natural Resources Program Grant and in 2013 the 385-acre Bald Mountain Preserve on the East Mountain came into being. \"North Branch Land Trust conserved a 385-acre portion of Bald Mountain in 2013 and transferred the property to Natural Lands Trust that same year,\" said Paul Lumia, NBLT Executive Director. \"Bald Mountain is a unique natural area in that it straddles two significate watersheds, the Delaware watershed to the east and the Susquehanna watershed to the west. The mountain also harbors a globally rare scrub oak barrens habitat that is invaluable to wildlife at local and landscape scales.\" So now, Lumia said, \"When you're driving on the Cross-Valley Expressway and you look up at the windmills, you know all that property below the windmills is protected.\" The rugged terrain of this mountain is largely forested. Dominant species include red oak, white oak and red maple. Two state-designated \"high quality\" streams flow through the property, bordered by native hemlocks and aspens. And the trail abuts a large glacial bog that is home to several rare and carnivorous plants. Wildlife abounds, from the chattering of migratory songbirds — such as scarlet tanagers, Eastern towhees and hermit thrushes — to black bears, bald eagles and the red eft (salamander) that charmed folks on Sunday. The walk left hikers feeling inspired. Sue Lenahan of Penn Lake said that \"it's very exciting to have opportunities to explore wonderful new places like this. I'm very happy NBLT is sponsoring these hikes.\" \"Today was a reminder of how fortunate we are to live in this area,\" said Debb Krysicki, also of Penn Lake. \"The hike with good people and company, the size of the turbines and the picturesque view of the nearby towns in the distance provided a great experience.\" October 1, 2017 | Citizen's Voice, The & Sunday Voice (Wilkes-Barre, PA) Section: Sports  555 Words OpenURL Link Like many of Natural Lands Trust's other nature preserves, Bald Mountain Preserve eventually will be open — free- of-charge — to visitors for passive recreation. Since its founding in 1953, Natural Lands Trust has protected more than 100,000 acres of land, including 42 nature preserves that it owns and manages in 13 counties. ",
    "BOB QUARTERONI, CORRESPONDENT, 'NBLT working to preserve Bald Mountain', Standard-Speaker (online), 1 Oct 2017 09\n‹https://infoweb.newsbank.com/apps/news/document-view?p=WORLDNEWS&docref=news/1674ADAE95020958›\n": " “I was told it was called Bald Mountain because in the past they would burn the top off — making it appear bald — so the blueberry bushes would thrive,” said Charlene Wildes, North Branch Land Trust volunteer naturalist. And thrive they have, a low, sprawling counterpoint to the gigantic alien-looking wind turbines that make up the Bear Creek Wind Farm at the very top of Bald Mountain in Bear Creek Township. A unique combination of the natural — and a view of technology that harnesses the natural to provide clean energy — greeted trekkers on a recent hike of Bald Mountain, a unique nature preserve. The hillside preserve stretches from Bear Creek Camp to near the top of the mountain, where the privately owned Bear Creek turbines spin, and which is privately owned and not open to hikers or sightseers. But looking at the turbines even from a distance makes you realize just how massive these whirring sentinels are. Seventeen hardy souls took on the three-mile hike that was sponsored by the North Branch Land Trust, which is helping to keep Bald Mountain pristine by preserving a large tract of it. Starting in 2011, NBLT worked with the landowners and others to preserve the property. They secured $850,00 in funding for the purchase from a Pennsylvania Department of Conservation and Natural Resources Program Grant and in 2013 the 385-acre Bald Mountain Preserve on the East Mountain came into being. “North Branch Land Trust conserved a 385-acre portion of Bald Mountain in 2013 and transferred the property to Natural Lands Trust that same year,” said Paul Lumia, NBLT Executive Director. “Bald Mountain is a unique natural area in that it straddles two significate watersheds, the Delaware watershed to the east and the Susquehanna watershed to the west. The mountain also harbors a globally rare scrub oak barrens habitat that is invaluable to wildlife at local and landscape scales.” So now, Lumia said, “When you’re driving on the Cross-Valley Expressway and you look up at the windmills, you know all that property below the windmills is protected.” The rugged terrain of this mountain is largely forested. Dominant species include red oak, white oak and red maple. Two state-designated “high quality” streams flow through the property, bordered by native hemlocks and aspens. And the trail abuts a large glacial bog that is home to several rare and carnivorous plants. Wildlife abounds, from the chattering of migratory songbirds — such as scarlet tanagers, Eastern towhees and hermit thrushes — to black bears, bald eagles and the red eft (salamander) that charmed folks on Sunday. The walk left hikers feeling inspired. Sue Lenahan of Penn Lake said that “it’s very exciting to have opportunities to explore wonderful new places like this. I’m very happy NBLT is sponsoring these hikes.” “Today was a reminder of how fortunate we are to live in this area,” said Debb Krysicki, also of Penn Lake. “The hike with good people and company, the size of the turbines and the picturesque view of the nearby towns in the October 1, 2017 | Standard-Speaker (Hazleton, PA) Author: BOB QUARTERONI; CORRESPONDENT  Section: B  557 Words Page: 09 OpenURL Link  “I was told it was called Bald Mountain because in the past they would burn the top off — making it appear bald — so the blueberry bushes would thrive,” said Charlene Wildes, North Branch Land Trust volunteer naturalist. And thrive they have, a low, sprawling counterpoint to the gigantic alien-looking wind turbines that make up the Bear Creek Wind Farm at the very top of Bald Mountain in Bear Creek Township. A unique combination of the natural — and a view of technology that harnesses the natural to provide clean energy — greeted trekkers on a recent hike of Bald Mountain, a unique nature preserve. The hillside preserve stretches from Bear Creek Camp to near the top of the mountain, where the privately owned Bear Creek turbines spin, and which is privately owned and not open to hikers or sightseers. But looking at the turbines even from a distance makes you realize just how massive these whirring sentinels are. Seventeen hardy souls took on the three-mile hike that was sponsored by the North Branch Land Trust, which is helping to keep Bald Mountain pristine by preserving a large tract of it. Starting in 2011, NBLT worked with the landowners and others to preserve the property. They secured $850,00 in funding for the purchase from a Pennsylvania Department of Conservation and Natural Resources Program Grant and in 2013 the 385-acre Bald Mountain Preserve on the East Mountain came into being. “North Branch Land Trust conserved a 385-acre portion of Bald Mountain in 2013 and transferred the property to Natural Lands Trust that same year,” said Paul Lumia, NBLT Executive Director. “Bald Mountain is a unique natural area in that it straddles two significate watersheds, the Delaware watershed to the east and the Susquehanna watershed to the west. The mountain also harbors a globally rare scrub oak barrens habitat that is invaluable to wildlife at local and landscape scales.” So now, Lumia said, “When you’re driving on the Cross-Valley Expressway and you look up at the windmills, you know all that property below the windmills is protected.” The rugged terrain of this mountain is largely forested. Dominant species include red oak, white oak and red maple. Two state-designated “high quality” streams flow through the property, bordered by native hemlocks and aspens. And the trail abuts a large glacial bog that is home to several rare and carnivorous plants. Wildlife abounds, from the chattering of migratory songbirds — such as scarlet tanagers, Eastern towhees and hermit thrushes — to black bears, bald eagles and the red eft (salamander) that charmed folks on Sunday. The walk left hikers feeling inspired. Sue Lenahan of Penn Lake said that “it’s very exciting to have opportunities to explore wonderful new places like this. I’m very happy NBLT is sponsoring these hikes.” “Today was a reminder of how fortunate we are to live in this area,” said Debb Krysicki, also of Penn Lake. “The hike with good people and company, the size of the turbines and the picturesque view of the nearby towns in the October 1, 2017 | Standard-Speaker (Hazleton, PA) Author: BOB QUARTERONI; CORRESPONDENT  Section: B  557 Words Page: 09 OpenURL Link distance provided a great experience.” Like many of Natural Lands Trust’s other nature preserves, Bald Mountain Preserve eventually will be open — free- of-charge — to visitors for passive recreation. Since its founding in 1953, Natural Lands Trust has protected more than 100,000 acres of land, including 42 nature preserves that it owns and manages in 13 counties. ",
    "Bob Quarteroni, Correspondent, 'NBLT Working To Maintain Bald Mountain', Times-Tribune, The (online), 1 Oct 2017\n‹https://infoweb.newsbank.com/apps/news/document-view?p=WORLDNEWS&docref=news/1674467938209760›\nOctober 1, 2017 | Times-Tribune, The (Scranton, PA)\nAuthor: Bob Quarteroni; Correspondent  Section: Sports  553 Words\nOpenURL Link\n": " \"I was told it was called Bald Mountain because in the past they would burn the top off — making it appear bald — so the blueberry bushes would thrive,\" said Charlene Wildes, North Branch Land Trust volunteer naturalist. And thrive they have, a low, sprawling counterpoint to the gigantic alien-looking wind turbines that make up the Bear Creek Wind Farm at the very top of Bald Mountain in Bear Creek Twp. A unique combination of the natural — and a view of technology that harnesses the natural to provide clean energy — greeted trekkers on a recent hike of Bald Mountain, a unique nature preserve. The hillside preserve stretches from Bear Creek Camp to near the top of the mountain, where the privately owned Bear Creek turbines spin, and which is privately owned and not open to hikers or sightseers. But looking at the turbines even from a distance makes you realize just how massive these whirring sentinels are. Seventeen hardy souls took on the three-mile hike that was sponsored by the North Branch Land Trust, which is helping to keep Bald Mountain pristine by preserving a large tract of it. Starting in 2011, NBLT worked with the landowners and others to preserve the property. They secured funding for the purchase from a Pennsylvania Department of Conservation and Natural Resources Program Grant and in 2013 the 385-acre Bald Mountain Preserve on the East Mountain came into being. \"North Branch Land Trust conserved a 385-acre portion of Bald Mountain in 2013 and transferred the property to Natural Lands Trust that same year,\" said Paul Lumia, NBLT executive director. \"Bald Mountain is a unique natural area in that it straddles two significate watersheds, the Delaware watershed to the east and the Susquehanna watershed to the west. The mountain also harbors a globally rare scrub oak barrens habitat that is invaluable to wildlife at local and landscape scales.\" So now, Lumia said, \"When you're driving on the Cross-Valley Expressway and you look up at the windmills, you know all that property below the windmills is protected.\" The rugged terrain of this mountain is largely forested. Dominant species include red oak, white oak and red maple. Two state-designated \"high quality\" streams flow through the property, bordered by native hemlocks and aspens. And the trail abuts a large glacial bog that is home to several rare and carnivorous plants. Wildlife abounds, from the chattering of migratory songbirds — such as scarlet tanagers, Eastern towhees and hermit thrushes — to black bears, bald eagles and the red eft (salamander) that charmed folks Sunday. The walk left hikers feeling inspired. Sue Lenahan of Penn Lake said that \"it's very exciting to have opportunities to explore wonderful new places like this. I'm very happy NBLT is sponsoring these hikes.\" \"Today was a reminder of how fortunate we are to live in this area,\" said Debb Krysicki, also of Penn Lake. \"The hike with good people and company, the size of the turbines and the picturesque view of the nearby towns in the distance provided a great experience.\" Like many of Natural Lands Trust's other nature preserves, Bald Mountain Preserve eventually will be open — free-of-charge — to visitors for passive recreation. Since its founding in 1953, Natural Lands Trust has protected more than 100,000 acres of land, including 42 nature preserves that it owns and manages in 13 counties. ",
    "'Crews repairing wind turbine in Bear Creek Twp.', Citizen's Voice, The & Sunday Voice (online), 6 Jul 2017\n‹https://infoweb.newsbank.com/apps/news/document-view?p=WORLDNEWS&docref=news/16578D49C584A4B8›\nJuly 6, 2017 | Citizen's Voice, The & Sunday Voice (Wilkes-Barre, PA)\nSection: Local  209 Words\nOpenURL Link\n": " BEAR CREEK TWP. — Crews are at work repairing a wind turbine that was severely damaged in a fire last year at the Bear Creek Wind Farm. The turbine caught fire Nov. 10, and firefighters were unable to access it because of falling debris. As a result, firefighters let the blaze burn itself out, sending a thick cloud of black smoke billowing over parts of the Wyoming Valley. Workers seen in the area this week are busy replacing the turbine, said Kelly Kimberly, spokeswoman for Dallas, Texas-based Leeward Renewable Energy, which owns the wind farm. \"We're in the process of completing the replacement,\" she said. Once the replacement is complete, crews will have to conduct testing prior to the turbine returning to service, she said. An estimated date of completion was not known. The wind farm on Bald Mountain consists of a dozen 256-foot tall turbines that generate about 75 million kilowatt- hours — enough energy to power 6,480 homes per year. Under an agreement, the energy is sold to Pennsylvania Power & Light Corp. ",
    "'Windmill fire sends black smoke across the valley', Citizen's Voice, The & Sunday Voice (online), 11 Nov 2016\n‹https://infoweb.newsbank.com/apps/news/document-view?p=WORLDNEWS&docref=news/16097347615AC1E0›\nNovember 11, 2016 | Citizen's Voice, The & Sunday Voice (Wilkes-Barre, PA)\nSection: Local  167 Words\nOpenURL Link\n": " BEAR CREEK TWP. — A fire at a wind turbine in Bear Creek Township sent a thick cloud of black smoke billowing over parts of the Wyoming Valley on Thursday. The fire started at about 2 p.m. at a windmill farm on Bald Mountain, where rows of wind turbines generate electrical power. Multiple fire departments battled the blaze at the turbine, which was reported to be fully involved. The smoke dissipated after about an hour, as of about 3 p.m. The windmill farm generates electrical power for PPL Electric Utilities but PPL does not own the property, a PPL spokeswoman said Thursday. Attempts to reach Bear Creek Township firefighters for more information on Thursday were not successful. A listed phone number for the township fire station led to a dead line and did not ring through. ",
    "MEGAN HARRIS, 'Duquesne ranks 30thon green power user list', Pittsburgh Tribune-Review (online), 28 Nov 2013\n‹https://infoweb.newsbank.com/apps/news/document-view?p=WORLDNEWS&docref=news/14A61BD2977E5010›\nNovember 28, 2013 | Pittsburgh Tribune-Review (PA)\nAuthor: MEGAN HARRIS  372 Words\nOpenURL Link\n": " Duquesne University joined the Environmental Protection Agency’s list of the largest alternative-energy users in its update to the 2013 Green Power Challenge. Ranked at No. 30 in the nation, the school uses more than 18 million kilowatt-hours of green power annually — enough to meet 49 percent of the university’s electricity use and avoid carbon dioxide emissions comparable to nearly 3,000 passenger vehicles per year. Four Western Pennsylvania colleges and universities — Allegheny College, Carnegie Mellon, Mercyhurst and Chatham —‑ use green energy to support 100 percent of their campus needs, according to the EPA report. Green power is electricity generated from environmentally preferable renewable resources, such as wind, solar, geothermal, biogas, eligible biomass and low-impact hydro. The EPA’s challenge encourages colleges and universities to adopt environmentally sustainable programs by providing publicity and federal recognition. “The university is proud to be recognized by the (EPA) for purchase of green power,” said Rod Dobish, executive director of facilities management. “We continue to be committed to reducing our carbon footprint, and the purchase of green power is one of our strategies to assist with protecting the environment.” CMU was the first school to sign long-term energy contracts with Community Energy Inc. of Radnor more than a decade ago. Those contributions allowed Community Energy to build the Somerset Wind Farm and later the Bear Creek Wind Farm in central Pennsylvania. In Pennsylvania, where only 4 percent of the power that electric companies sell comes from renewable energy sources, participation in an EPA challenge requires colleges to purchase renewable energy credits to offset their consumption of more typical sources like coal, gas and nuclear energy. Rod Dobish, executive director of facilities management at Duquesne, said purchasing the credits is a matter of doing “the environmentally responsible thing for the next generation.” Chatham produces a portion of its energy through rooftop thermal panels to heat water at its Shadyside campus and plans to use geothermal wells at its new Eden Hall Campus. University sustainability coordinator Mary Whitney estimated it costs the school about $2,000 to maintain those features. EPA’s Green Power Partnership will track the collegiate athletic conferences with the highest overall green power usage through the spring of 2014. Megan Harris is a staff writer for Trib Total Media. ",
    "MEGAN HARRIS, 'Duquesne ranks 30th on green power list', Valley News Dispatch (online), 28 Nov 2013\n‹https://infoweb.newsbank.com/apps/news/document-view?p=WORLDNEWS&docref=news/14A6245136D8D908›\nNovember 28, 2013 | Valley News Dispatch (New Kensington, PA)\nAuthor: MEGAN HARRIS  347 Words\nOpenURL Link\n": " Duquesne University joined the Environmental Protection Agency’s list of the largest alternative-energy users in its update to the 2013 Green Power Challenge. Ranked at No. 30 in the nation, the school uses more than 18 million kilowatt-hours of green power annually — enough to meet 49 percent of the university’s electricity use and avoid carbon dioxide emissions comparable to nearly 3,000 passenger vehicles per year. Four Western Pennsylvania colleges and universities — Allegheny College, Carnegie Mellon, Mercyhurst and Chatham —‑ use green energy to support 100 percent of their campus needs, according to the EPA report. Green power is electricity generated from environmentally preferable renewable resources, such as wind, solar, geothermal, biogas, eligible biomass and low-impact hydro. The EPA’s challenge encourages colleges and universities to adopt environmentally sustainable programs by providing publicity and federal recognition. “The university is proud to be recognized by the (EPA) for purchase of green power,” said Rod Dobish, executive director of facilities management. “We continue to be committed to reducing our carbon footprint, and the purchase of green power is one of our strategies to assist with protecting the environment.” CMU was the first school to sign long-term energy contracts with Community Energy Inc. of Radnor more than a decade ago. Those contributions allowed Community Energy to build the Somerset Wind Farm and later the Bear Creek Wind Farm in central Pennsylvania. In Pennsylvania, where only 4 percent of the power that electric companies sell comes from renewable energy sources, participation in an EPA challenge requires colleges to purchase renewable energy credits to offset their consumption of more typical sources like coal, gas and nuclear energy. Chatham produces a portion of its energy through rooftop thermal panels to heat water at its Shadyside campus and plans to use geothermal wells at its new Eden Hall Campus. University sustainability coordinator Mary Whitney estimated it costs the school about $2,000 to maintain those features. EPA’s Green Power Partnership will track the collegiate athletic conferences with the highest overall green power usage through the spring of 2014. Megan Harris is a staff writer for Trib Total Media. ",
    "MEGAN HARRIS, 'Duquesne ranks 30thon green power user list', Pittsburgh Tribune-Review (online), 27 Nov 2013\n‹https://infoweb.newsbank.com/apps/news/document-view?p=WORLDNEWS&docref=news/14A5C4E121E5EEC8›\nNovember 27, 2013 | Pittsburgh Tribune-Review (PA)\nAuthor: MEGAN HARRIS  372 Words\nOpenURL Link\n": " Duquesne University joined the Environmental Protection Agency’s list of the largest alternative-energy users in its update to the 2013 Green Power Challenge. Ranked at No. 30 in the nation, the school uses more than 18 million kilowatt-hours of green power annually — enough to meet 49 percent of the university’s electricity use and avoid carbon dioxide emissions comparable to nearly 3,000 passenger vehicles per year. Four Western Pennsylvania colleges and universities — Allegheny College, Carnegie Mellon, Mercyhurst and Chatham —‑ use green energy to support 100 percent of their campus needs, according to the EPA report. Green power is electricity generated from environmentally preferable renewable resources, such as wind, solar, geothermal, biogas, eligible biomass and low-impact hydro. The EPA’s challenge encourages colleges and universities to adopt environmentally sustainable programs by providing publicity and federal recognition. “The university is proud to be recognized by the (EPA) for purchase of green power,” said Rod Dobish, executive director of facilities management. “We continue to be committed to reducing our carbon footprint, and the purchase of green power is one of our strategies to assist with protecting the environment.” CMU was the first school to sign long-term energy contracts with Community Energy Inc. of Radnor more than a decade ago. Those contributions allowed Community Energy to build the Somerset Wind Farm and later the Bear Creek Wind Farm in central Pennsylvania. In Pennsylvania, where only 4 percent of the power that electric companies sell comes from renewable energy sources, participation in an EPA challenge requires colleges to purchase renewable energy credits to offset their consumption of more typical sources like coal, gas and nuclear energy. Rod Dobish, executive director of facilities management at Duquesne, said purchasing the credits is a matter of doing “the environmentally responsible thing for the next generation.” Chatham produces a portion of its energy through rooftop thermal panels to heat water at its Shadyside campus and plans to use geothermal wells at its new Eden Hall Campus. University sustainability coordinator Mary Whitney estimated it costs the school about $2,000 to maintain those features. EPA’s Green Power Partnership will track the collegiate athletic conferences with the highest overall green power usage through the spring of 2014. Megan Harris is a staff writer for Trib Total Media. ",
    "ALEXANDER DELORME, STAFF WRITER, 'Wind power coming into play locally', Vermilion Standard (online), 24 Jul 2013 1\n‹https://infoweb.newsbank.com/apps/news/document-view?p=WORLDNEWS&docref=news/14EF69E6ED81D760›\n": " The Counties of Minburn and Vermilion River are one step closer to harnessing sustainable energy. E. ON Climate and Renewables North America is rapidly updating its portfolio of projects, and it looks to expand into the counties with its Grizzly Bear Creek Wind Power Project. The company held one of many upcoming public consultations last Tuesday at the Elkís Hall in Vermilion. \"The benefit of these kinds of events is communication,\" said wildlife ecologist Stephen Glendinning. \"The public can find out who E. ON is. What do they want to do and why do they want to do it? And we're open to any feedback. We've certainly benefited from local feedback.\" The project would have up to 50 wind turbines erected within the counties. Although environmental studies will continue, enough has been accomplished since the beginning of 2011 to put together a proposed map of where the turbines will be constructed. \"The province is built on resource extraction. You have agriculture, oil and gas, and forestry, and wind is just another new form of that,\" said Glendinning. The project center is to be located approximately 6 km south of Mannville and 14 km southwest of Vermilion within Townships 48 and 49, ranges 7 and 8 (W4M). The size of the project is 120 megawatts, equaling 2.4 megawatts per turbine. With each proposed tower reaching 91 meters tall and having a 117 meter wide rotor diameter, many residents are concerned about the noise associated with large turbines. \"Noise is a concern, and dealing with noise has its issues,\" said Glendinning. \"But the laws regarding how much noise residents can be exposed to are more stringent in Alberta than in the other provinces. We have a lot less likelihood of issues.\" Wind energy projects must meet the Alberta Utilities Commission regulatory requirements for noise control. The two sources of noise associated with wind turbines are aerodynamic and mechanical, emanating from the rotating blades and the ground-level gearboxes, respectively. Glendinning says that so far there is nothing to worry about. \"You have to take into account the existing background noises, the existing facilities on the landscape, approved facilities that are not yet built, you do all then and then you add your project. We've done that. At the end of the day you cannot expose residents to levels beyond what the utilities commission deems.\" Another concern is the impact the turbines may have on the environment. \"We have to look at multi-seasonal wildlife issues,\" said Glendinning. \"You have to look at everything from bird migration to bat migration, what animals use the environment in the summer, what are the breeding bird species that use it, fall migrants, etc. You have to determine if any of those factors are going to be a concern.\" \"Other major considerations relate to archaeology and land-owner acceptance. You don't want to be blasting July 24, 2013 | Vermilion Standard (Alberta, Canada) Author: ALEXANDER DELORME, STAFF WRITER  Section: News  585 Words Page: 1 OpenURL Link  The Counties of Minburn and Vermilion River are one step closer to harnessing sustainable energy. E. ON Climate and Renewables North America is rapidly updating its portfolio of projects, and it looks to expand into the counties with its Grizzly Bear Creek Wind Power Project. The company held one of many upcoming public consultations last Tuesday at the Elkís Hall in Vermilion. \"The benefit of these kinds of events is communication,\" said wildlife ecologist Stephen Glendinning. \"The public can find out who E. ON is. What do they want to do and why do they want to do it? And we're open to any feedback. We've certainly benefited from local feedback.\" The project would have up to 50 wind turbines erected within the counties. Although environmental studies will continue, enough has been accomplished since the beginning of 2011 to put together a proposed map of where the turbines will be constructed. \"The province is built on resource extraction. You have agriculture, oil and gas, and forestry, and wind is just another new form of that,\" said Glendinning. The project center is to be located approximately 6 km south of Mannville and 14 km southwest of Vermilion within Townships 48 and 49, ranges 7 and 8 (W4M). The size of the project is 120 megawatts, equaling 2.4 megawatts per turbine. With each proposed tower reaching 91 meters tall and having a 117 meter wide rotor diameter, many residents are concerned about the noise associated with large turbines. \"Noise is a concern, and dealing with noise has its issues,\" said Glendinning. \"But the laws regarding how much noise residents can be exposed to are more stringent in Alberta than in the other provinces. We have a lot less likelihood of issues.\" Wind energy projects must meet the Alberta Utilities Commission regulatory requirements for noise control. The two sources of noise associated with wind turbines are aerodynamic and mechanical, emanating from the rotating blades and the ground-level gearboxes, respectively. Glendinning says that so far there is nothing to worry about. \"You have to take into account the existing background noises, the existing facilities on the landscape, approved facilities that are not yet built, you do all then and then you add your project. We've done that. At the end of the day you cannot expose residents to levels beyond what the utilities commission deems.\" Another concern is the impact the turbines may have on the environment. \"We have to look at multi-seasonal wildlife issues,\" said Glendinning. \"You have to look at everything from bird migration to bat migration, what animals use the environment in the summer, what are the breeding bird species that use it, fall migrants, etc. You have to determine if any of those factors are going to be a concern.\" \"Other major considerations relate to archaeology and land-owner acceptance. You don't want to be blasting July 24, 2013 | Vermilion Standard (Alberta, Canada) Author: ALEXANDER DELORME, STAFF WRITER  Section: News  585 Words Page: 1 OpenURL Link through historical structures or sites and you have to have permission to build on private land.\" E. ON hopes that the benefits of wind power will help sell the project with landowners. The turbine project would create a cost-effective and environmentally friendly power source which would power almost 300 homes per megawatt. The project would also create temporary and permanent jobs in the area and generate considerable municipal tax revenues. E. ON plans to submit its application to the AUC during the third-quarter of 2013 and hopes the commission will reach a decision by the second-quarter of 2014. Public consultation will be ongoing and will continue through target construction phase targeted for the first-quarter of 2015. Copyright © 2013 Vermilion Standard Citation (aglc Style) ALEXANDER DELORME, STAFF WRITER, '', Vermilion Standard (online), 24 Jul 2013 1 ‹https://infoweb.newsbank.com/apps/news/document-view?p=WORLDNEWS&docref=news/14EF69E6ED81D760› ",
    "DEBRA ERDLEY, 'Colleges earn green credits', Pittsburgh Tribune-Review (online), 26 Apr 2013\n‹https://infoweb.newsbank.com/apps/news/document-view?p=WORLDNEWS&docref=news/145E9CA537E67490›\n": " As Pennsylvania colleges venture deeper into alternative-energy sources, they’re giving crucial support to fledgling energy companies. Eight Pennsylvania colleges and universities are cited as top alternative-energy buyers in the Environmental Protection Agency’s 2013 Green Power Challenge. Among them, Allegheny College and Carnegie Mellon, Duquesne, Mercyhurst and Chatham are amid Western Pennsylvania’s rich coal and gas deposits. According to the EPA, their purchases offset carbon-dioxide emissions equivalent to those from 70,233 vehicles during a year. Perhaps just as important, by making a stand for green energy, colleges affect the marketplace, said Blaine Collison, director of the EPA’s Green Power Program. Colleges that signed long-term contracts to purchase renewable-energy credits about 12 years ago formed the foundation that allowed Community Energy Inc. of Radnor to build the Somerset Wind Farm and later the Bear Creek Wind Farm in North Central Pennsylvania. “Colleges were the biggest part of it — signing up for wind energy when there was none,” said Community Energy President Brent Alderfer. Alderfer said Exelon Corp. agreed to provide wholesale credit for the project and put the energy on the grid. Colleges stepped forward as guaranteed retail customers. Carnegie Mellon, the first school to sign on, purchases national wind credits to offset 100 percent of its electricity. “When people take a look at the impact of climate change, I think it is people within the university community who see the peril of continuing to use the old, high carbon-dioxide energy sources,” said Carnegie Mellon engineer Marty Altschul. At Duquesne, officials said purchasing renewable-energy credits is a matter of doing “the environmentally responsible thing for the next generation.” “We really believe we’re educating the future leaders of our country, and we need to set the right example,” said Rod Dobish, executive director of facilities management at Duquesne. In Pennsylvania, where only 4 percent of the power that electric companies sell comes from renewable-energy sources, participation in the EPA challenge typically means many of the colleges must purchase renewable-energy credits. The credits support the production of alternative energy to offset the schools’ use of power from coal, gas or nuclear sources that dominate electricity production here. Universities concede there is a cost to these commitments but say that cost — which Altschul said adds less than 1 percent to Carnegie Mellon’s bill — is small compared to the message it sends. At Chatham in Shadyside, university sustainability coordinator Mary Whitney estimated that purchasing renewable- energy credits to offset 100 percent of the school’s energy usage adds about $2,000 a year to its energy costs. April 26, 2013 | Pittsburgh Tribune-Review (PA) Author: DEBRA ERDLEY  487 Words OpenURL Link  As Pennsylvania colleges venture deeper into alternative-energy sources, they’re giving crucial support to fledgling energy companies. Eight Pennsylvania colleges and universities are cited as top alternative-energy buyers in the Environmental Protection Agency’s 2013 Green Power Challenge. Among them, Allegheny College and Carnegie Mellon, Duquesne, Mercyhurst and Chatham are amid Western Pennsylvania’s rich coal and gas deposits. According to the EPA, their purchases offset carbon-dioxide emissions equivalent to those from 70,233 vehicles during a year. Perhaps just as important, by making a stand for green energy, colleges affect the marketplace, said Blaine Collison, director of the EPA’s Green Power Program. Colleges that signed long-term contracts to purchase renewable-energy credits about 12 years ago formed the foundation that allowed Community Energy Inc. of Radnor to build the Somerset Wind Farm and later the Bear Creek Wind Farm in North Central Pennsylvania. “Colleges were the biggest part of it — signing up for wind energy when there was none,” said Community Energy President Brent Alderfer. Alderfer said Exelon Corp. agreed to provide wholesale credit for the project and put the energy on the grid. Colleges stepped forward as guaranteed retail customers. Carnegie Mellon, the first school to sign on, purchases national wind credits to offset 100 percent of its electricity. “When people take a look at the impact of climate change, I think it is people within the university community who see the peril of continuing to use the old, high carbon-dioxide energy sources,” said Carnegie Mellon engineer Marty Altschul. At Duquesne, officials said purchasing renewable-energy credits is a matter of doing “the environmentally responsible thing for the next generation.” “We really believe we’re educating the future leaders of our country, and we need to set the right example,” said Rod Dobish, executive director of facilities management at Duquesne. In Pennsylvania, where only 4 percent of the power that electric companies sell comes from renewable-energy sources, participation in the EPA challenge typically means many of the colleges must purchase renewable-energy credits. The credits support the production of alternative energy to offset the schools’ use of power from coal, gas or nuclear sources that dominate electricity production here. Universities concede there is a cost to these commitments but say that cost — which Altschul said adds less than 1 percent to Carnegie Mellon’s bill — is small compared to the message it sends. At Chatham in Shadyside, university sustainability coordinator Mary Whitney estimated that purchasing renewable- energy credits to offset 100 percent of the school’s energy usage adds about $2,000 a year to its energy costs. April 26, 2013 | Pittsburgh Tribune-Review (PA) Author: DEBRA ERDLEY  487 Words OpenURL Link Chatham is among a growing number of schools that produce at least a portion of their energy. Rooftop thermal panels on dorms at its Shadyside campus provide hot water. Its Eden Hall campus, under construction in Richland, will rely on solar and geothermal energy produced on campus. “We’re drilling the well for our geothermal system at Eden Hall today,” Whitney said. Debra Erdley is a Trib Total Media staff writer. Reach her at 412-320-7996 or derdley@tribweb.com. ",
    "DEBRA ERDLEY, 'Colleges big buyers of renewable energy credits', Tribune-Review (online), 26 Apr 2013\n‹https://infoweb.newsbank.com/apps/news/document-view?p=WORLDNEWS&docref=news/145EE73821D671F0›\n": " As Pennsylvania colleges venture deeper into alternative energy sources, they’re giving crucial support to fledgling energy companies. Eight Pennsylvania colleges and universities are cited as top alternative energy buyers in the U.S. Environmental Protection Agency’s 2013 Green Power Challenge. Among them, Allegheny College and Carnegie Mellon, Duquesne, Mercyhurst and Chatham universities are located in the midst of Western Pennsylvania’s rich coal and gas deposits. According to the EPA, their purchases offset carbon dioxide emissions equivalent to those from 70,233 cars during a year. Perhaps just as important, by making a stand for green energy, colleges affect the marketplace, said Blaine Collison, the EPA’s Green Power Program director. Colleges that signed long-term contracts to purchase renewable energy credits 10 years ago formed the foundation that allowed Community Energy Inc. of Radnor to build the Somerset Wind Farm and later the Bear Creek Wind Farm in North Central Pennsylvania. “Colleges were the biggest part of it, signing up for wind energy when there was none,” said Community Energy President Brent Alderfer. Alderfer said Exelon Corp. agreed to provide wholesale credit for the project and put the energy on the grid. Colleges stepped forward as guaranteed retail customers. Carnegie Mellon, the first school to sign on, purchases national wind credits to offset 100 percent of its electricity. “When people take a look at the impact of climate change, I think it is people within the university community who see the peril of continuing to use the old high carbon dioxide energy sources,” said Carnegie Mellon engineer Marty Altschul. At Duquesne, officials said purchasing renewable energy credits is a matter of doing “the environmentally responsible thing for the next generation.” “We really believe we’re educating the future leaders of our country and we need to set the right example,” said Rod Dobish, executive director of facilities management at Duquesne. In Pennsylvania, where only 4 percent of the power that electric companies sell comes from renewable energy sources, participating in the EPA challenge typically means many of the colleges must purchase renewable energy credits. The credits support the production of alternative energy to offset the schools’ use of power from coal, gas or nuclear sources that dominate electricity production here. Universities concede there is a cost to these commitments but say that cost — which Altschul said adds less than 1 percent to Carnegie Mellon’s bill — is small compared to the message it sends. At Chatham in Shadyside, university sustainability coordinator Mary Whitney estimated purchasing renewable energy credits to offset 100 percent of the school’s energy usage adds about $2,000 a year to its energy costs. April 26, 2013 | Tribune-Review (Greensburg, PA) Author: DEBRA ERDLEY  496 Words OpenURL Link  As Pennsylvania colleges venture deeper into alternative energy sources, they’re giving crucial support to fledgling energy companies. Eight Pennsylvania colleges and universities are cited as top alternative energy buyers in the U.S. Environmental Protection Agency’s 2013 Green Power Challenge. Among them, Allegheny College and Carnegie Mellon, Duquesne, Mercyhurst and Chatham universities are located in the midst of Western Pennsylvania’s rich coal and gas deposits. According to the EPA, their purchases offset carbon dioxide emissions equivalent to those from 70,233 cars during a year. Perhaps just as important, by making a stand for green energy, colleges affect the marketplace, said Blaine Collison, the EPA’s Green Power Program director. Colleges that signed long-term contracts to purchase renewable energy credits 10 years ago formed the foundation that allowed Community Energy Inc. of Radnor to build the Somerset Wind Farm and later the Bear Creek Wind Farm in North Central Pennsylvania. “Colleges were the biggest part of it, signing up for wind energy when there was none,” said Community Energy President Brent Alderfer. Alderfer said Exelon Corp. agreed to provide wholesale credit for the project and put the energy on the grid. Colleges stepped forward as guaranteed retail customers. Carnegie Mellon, the first school to sign on, purchases national wind credits to offset 100 percent of its electricity. “When people take a look at the impact of climate change, I think it is people within the university community who see the peril of continuing to use the old high carbon dioxide energy sources,” said Carnegie Mellon engineer Marty Altschul. At Duquesne, officials said purchasing renewable energy credits is a matter of doing “the environmentally responsible thing for the next generation.” “We really believe we’re educating the future leaders of our country and we need to set the right example,” said Rod Dobish, executive director of facilities management at Duquesne. In Pennsylvania, where only 4 percent of the power that electric companies sell comes from renewable energy sources, participating in the EPA challenge typically means many of the colleges must purchase renewable energy credits. The credits support the production of alternative energy to offset the schools’ use of power from coal, gas or nuclear sources that dominate electricity production here. Universities concede there is a cost to these commitments but say that cost — which Altschul said adds less than 1 percent to Carnegie Mellon’s bill — is small compared to the message it sends. At Chatham in Shadyside, university sustainability coordinator Mary Whitney estimated purchasing renewable energy credits to offset 100 percent of the school’s energy usage adds about $2,000 a year to its energy costs. April 26, 2013 | Tribune-Review (Greensburg, PA) Author: DEBRA ERDLEY  496 Words OpenURL Link Chatham is among a growing number of schools that produce at least a portion of their energy. Rooftop thermal panels on dorms at its Shadyside campus provide hot water. Its Eden Hall campus, under construction in Richland, will rely on solar and geothermal energy produced on campus. “We’re drilling the well for our geothermal system at Eden Hall today,” Whitney said. Debra Erdley is a Trib Total Media staff writer. Reach her at 412-320-7996. ",
    "DEBRA ERDLEY, 'Area colleges earn green credits', Valley News Dispatch (online), 26 Apr 2013\n‹https://infoweb.newsbank.com/apps/news/document-view?p=WORLDNEWS&docref=news/145EEB63294EA178›\n": " As Pennsylvania colleges venture deeper into alternative-energy sources, they’re giving crucial support to fledgling energy companies. Eight Pennsylvania colleges and universities are cited as top alternative-energy buyers in the Environmental Protection Agency’s 2013 Green Power Challenge. Among them, Allegheny College and Carnegie Mellon, Duquesne, Mercyhurst and Chatham are amid Western Pennsylvania’s rich coal and gas deposits. According to the EPA, their purchases offset carbon-dioxide emissions equivalent to those from 70,233 vehicles during a year. Perhaps just as important, by making a stand for green energy, colleges affect the marketplace, said Blaine Collison, director of the EPA’s Green Power Program. Colleges that signed long-term contracts to purchase renewable-energy credits about 12 years ago formed the foundation that allowed Community Energy Inc. of Radnor to build the Somerset Wind Farm and later the Bear Creek Wind Farm in North Central Pennsylvania. “Colleges were the biggest part of it — signing up for wind energy when there was none,” said Community Energy President Brent Alderfer. Alderfer said Exelon Corp. agreed to provide wholesale credit for the project and put the energy on the grid. Colleges stepped forward as guaranteed retail customers. Carnegie Mellon, the first school to sign on, purchases national wind credits to offset 100 percent of its electricity. “When people take a look at the impact of climate change, I think it is people within the university community who see the peril of continuing to use the old, high carbon-dioxide energy sources,” said Carnegie Mellon engineer Marty Altschul. At Duquesne, officials said purchasing renewable-energy credits is a matter of doing “the environmentally responsible thing for the next generation.” “We really believe we’re educating the future leaders of our country, and we need to set the right example,” said Rod Dobish, executive director of facilities management at Duquesne. In Pennsylvania, where only 4 percent of the power that electric companies sell comes from renewable-energy sources, participation in the EPA challenge typically means many of the colleges must purchase renewable-energy credits. The credits support the production of alternative energy to offset the schools’ use of power from coal, gas or nuclear sources that dominate electricity production here. Universities concede there is a cost to these commitments but say that cost — which Altschul said adds less than 1 percent to Carnegie Mellon’s bill — is small compared to the message it sends. At Chatham in Shadyside, university sustainability coordinator Mary Whitney estimated that purchasing renewable- energy credits to offset 100 percent of the school’s energy usage adds about $2,000 a year to its energy costs. April 26, 2013 | Valley News Dispatch (New Kensington, PA) Author: DEBRA ERDLEY  487 Words OpenURL Link  As Pennsylvania colleges venture deeper into alternative-energy sources, they’re giving crucial support to fledgling energy companies. Eight Pennsylvania colleges and universities are cited as top alternative-energy buyers in the Environmental Protection Agency’s 2013 Green Power Challenge. Among them, Allegheny College and Carnegie Mellon, Duquesne, Mercyhurst and Chatham are amid Western Pennsylvania’s rich coal and gas deposits. According to the EPA, their purchases offset carbon-dioxide emissions equivalent to those from 70,233 vehicles during a year. Perhaps just as important, by making a stand for green energy, colleges affect the marketplace, said Blaine Collison, director of the EPA’s Green Power Program. Colleges that signed long-term contracts to purchase renewable-energy credits about 12 years ago formed the foundation that allowed Community Energy Inc. of Radnor to build the Somerset Wind Farm and later the Bear Creek Wind Farm in North Central Pennsylvania. “Colleges were the biggest part of it — signing up for wind energy when there was none,” said Community Energy President Brent Alderfer. Alderfer said Exelon Corp. agreed to provide wholesale credit for the project and put the energy on the grid. Colleges stepped forward as guaranteed retail customers. Carnegie Mellon, the first school to sign on, purchases national wind credits to offset 100 percent of its electricity. “When people take a look at the impact of climate change, I think it is people within the university community who see the peril of continuing to use the old, high carbon-dioxide energy sources,” said Carnegie Mellon engineer Marty Altschul. At Duquesne, officials said purchasing renewable-energy credits is a matter of doing “the environmentally responsible thing for the next generation.” “We really believe we’re educating the future leaders of our country, and we need to set the right example,” said Rod Dobish, executive director of facilities management at Duquesne. In Pennsylvania, where only 4 percent of the power that electric companies sell comes from renewable-energy sources, participation in the EPA challenge typically means many of the colleges must purchase renewable-energy credits. The credits support the production of alternative energy to offset the schools’ use of power from coal, gas or nuclear sources that dominate electricity production here. Universities concede there is a cost to these commitments but say that cost — which Altschul said adds less than 1 percent to Carnegie Mellon’s bill — is small compared to the message it sends. At Chatham in Shadyside, university sustainability coordinator Mary Whitney estimated that purchasing renewable- energy credits to offset 100 percent of the school’s energy usage adds about $2,000 a year to its energy costs. April 26, 2013 | Valley News Dispatch (New Kensington, PA) Author: DEBRA ERDLEY  487 Words OpenURL Link Chatham is among a growing number of schools that produce at least a portion of their energy. Rooftop thermal panels on dorms at its Shadyside campus provide hot water. Its Eden Hall campus, under construction in Richland, will rely on solar and geothermal energy produced on campus. “We’re drilling the well for our geothermal system at Eden Hall today,” Whitney said. Debra Erdley is a Trib Total Media staff writer. Reach her at 412-320-7996 or derdley@tribweb.com. ",
    "'$200M plan for PPL power line, substations submitted for approval', Citizen's Voice, The & Sunday Voice (online), 1 Jan 2013\n‹https://infoweb.newsbank.com/apps/news/document-view?p=WORLDNEWS&docref=news/14391C2CAB415188›\nJanuary 1, 2013 | Citizen's Voice, The & Sunday Voice (Wilkes-Barre, PA)\nSection: Local  367 Words\nOpenURL Link\n": " PPL Electric Utilities has submitted the Northeast-Pocono Reliability Project to the Pennsylvania Public Utility Commission for approval. The $200 million project involves construction of three new electrical substations and a 230-kilovolt power line, part of which will run through Luzerne County. Its purpose is to improve service and reduce outages for approximately 250,000 customers in Carbon, Lackawanna, Luzerne, Monroe, Pike and Wayne counties. PPL already solicited input at 13 public meetings. The PUC review process takes about a year, during which there will be opportunities for additional public input. The power line route represents the company's best effort to balance social, environmental and cost impacts while ensuring PPL can fulfill its obligation to provide reliable electric service, said Stephanie Raymond, PPL Electric Utilities Transmission and Substation vice president. \"We recognize that there is no perfect route for a power line,\" she said. \"That's why we are so diligent about seeking and listening to public input and making changes to the project - where we can - to address any concerns that may be raised.\" PPL Electric Utilities will construct about 57 miles of new 230-kilovolt power line from the Wilkes-Barre area to an area west of Hawley in Wayne County using steel poles averaging 145 feet in height. The new power line will connect the new electrical substations to the existing high-voltage grid, strengthening the local electric delivery network in a market that has been growing for decades and is expected to increase further. For the Luzerne County section of the project, the route will start at the PPL Electric Utilities Jenkins Substation in Plains Township and run parallel to an existing transmission line for about 2.4 miles in an easterly direction, crossing Interstate 81 and the Pennsylvania Turnpike. After crossing the turnpike, the route proceeds south for 4.6 miles, crossing Bald Mountain Road and passing around the eastern edge of the Bear Creek wind farm to intersect with an existing natural gas pipeline right-of-way. The power line route will then turn southeast for 7.7 miles, paralleling the north side of the pipeline, crossing sections of State Game Lands 91 and passing near a natural gas compressor station to end at a to-be-constructed West Pocono Substation in Buck Township. For information, visit www.pplreliablepower.com/northeast-pocono. ",
    "'Juniata College makes commitment to Keystone Solar', Daily News, The (online), 17 Dec 2012\n‹https://infoweb.newsbank.com/apps/news/document-view?p=WORLDNEWS&docref=news/16408B3D7130A2D8›\n": " Juniata College has committed to purchase 50 megawatt hours of Keystone Solar energy certificates annually for the next seven years. Community Energy will supply the clean energy generation from the Keystone Solar Project that is up and running in Lancaster. In addition, Juniata will partner with Keystone Solar in the energy company's PRAXIS product program, an innovative product where the energy company provides renewable energy certificates for sustainable power and access to online learning platform called Building Keystone Solar so partner institutions can incorporate solar energy educational lessons and tools into class work in environmental science and possibly other courses. As the country and state move toward a clean energy future, sponsorship of the Keystone Solar Project highlights Juniata College's commitment to environmental sustainability. The 5 Megawatt Keystone Solar Farm is located in Lancaster County and will be one of largest solar projects in the state. The Keystone Solar Farm is a grid connected project, selling wholesale power into a 13-state electric power market, which began operations in fall 2012. Each time a renewable energy producer adds electricity to the national electric grid, those additions produce a Renewable Energy Credit. Such credits represent the additional cost and value of a specific amount of renewable energy that is generated. These credits are the industry standard method of accounting for renewable energy production. \"This achievement demonstrates Juniata College consistent leadership in matching renewable energy with educational opportunities. For Juniata College, the online lessons are an exciting opportunity. We look forward to introducing these new learning modules into the classroom,\" said Dennis Johnson, professor and chair of environmental science at Juniata. As part of the sponsorship commitment, Juniata College will have access to \"Building Keystone Solar\" an online course designed to invite students and professors behind the scenes of the utility-scale realworld solar project development process with in-depth videos, documents, designs and plans not otherwise available in the classroom. \"Building Keystone Solar\" is being developed to help expand experiential learning on campus and create pathways to careers in Renewable Energy for university students. An example of the course modules include: Solar 101, Environmental/Earth Sciences, Technology and Construction. Community Energy is proud to offer Pennsylvania's largest utility-scale solar project as a real-time teaching tool to Keystone green power customers. The materials will also feature explanations of renewable energy career paths from professionals in the field. Future graduates of Juniata College will have a greater renewable energy IQ as well as greater knowledge of the career paths available to them. Juniata College has a college wide initiative to reduce its carbon footprint. The college has already taken many steps toward this goal and is well on its way to reaching it. Purchasing Keystone Solar is one further step toward a sustainable energy future. In a difficult economy that demands excellence, Juniata College has set a strong example for how to not only set an environmental goal, but make that goal mean something. \"Juniata College has been a renewable energy leader for many years. Without renewable energy purchases like this one, renewable energy projects would not be built. Thanks to Juniata, Keystone Solar is happening. We hope that December 17, 2012 | Daily News, The (Huntingdon, Mount Union, PA) Section: Local News  926 Words OpenURL Link  Juniata College has committed to purchase 50 megawatt hours of Keystone Solar energy certificates annually for the next seven years. Community Energy will supply the clean energy generation from the Keystone Solar Project that is up and running in Lancaster. In addition, Juniata will partner with Keystone Solar in the energy company's PRAXIS product program, an innovative product where the energy company provides renewable energy certificates for sustainable power and access to online learning platform called Building Keystone Solar so partner institutions can incorporate solar energy educational lessons and tools into class work in environmental science and possibly other courses. As the country and state move toward a clean energy future, sponsorship of the Keystone Solar Project highlights Juniata College's commitment to environmental sustainability. The 5 Megawatt Keystone Solar Farm is located in Lancaster County and will be one of largest solar projects in the state. The Keystone Solar Farm is a grid connected project, selling wholesale power into a 13-state electric power market, which began operations in fall 2012. Each time a renewable energy producer adds electricity to the national electric grid, those additions produce a Renewable Energy Credit. Such credits represent the additional cost and value of a specific amount of renewable energy that is generated. These credits are the industry standard method of accounting for renewable energy production. \"This achievement demonstrates Juniata College consistent leadership in matching renewable energy with educational opportunities. For Juniata College, the online lessons are an exciting opportunity. We look forward to introducing these new learning modules into the classroom,\" said Dennis Johnson, professor and chair of environmental science at Juniata. As part of the sponsorship commitment, Juniata College will have access to \"Building Keystone Solar\" an online course designed to invite students and professors behind the scenes of the utility-scale realworld solar project development process with in-depth videos, documents, designs and plans not otherwise available in the classroom. \"Building Keystone Solar\" is being developed to help expand experiential learning on campus and create pathways to careers in Renewable Energy for university students. An example of the course modules include: Solar 101, Environmental/Earth Sciences, Technology and Construction. Community Energy is proud to offer Pennsylvania's largest utility-scale solar project as a real-time teaching tool to Keystone green power customers. The materials will also feature explanations of renewable energy career paths from professionals in the field. Future graduates of Juniata College will have a greater renewable energy IQ as well as greater knowledge of the career paths available to them. Juniata College has a college wide initiative to reduce its carbon footprint. The college has already taken many steps toward this goal and is well on its way to reaching it. Purchasing Keystone Solar is one further step toward a sustainable energy future. In a difficult economy that demands excellence, Juniata College has set a strong example for how to not only set an environmental goal, but make that goal mean something. \"Juniata College has been a renewable energy leader for many years. Without renewable energy purchases like this one, renewable energy projects would not be built. Thanks to Juniata, Keystone Solar is happening. We hope that December 17, 2012 | Daily News, The (Huntingdon, Mount Union, PA) Section: Local News  926 Words OpenURL Link more universities will make the same choice to support local solar,\" said Brent Alderfer, president of Community Energy. This purchase goes beyond simply reducing the college's carbon footprint. It is also about supporting local renewable energy. The purchase directly supports solar in Pennsylvania. The Keystone Solar Project isa5megawatt(AC)groundmounted solar project that will produce approximately 8,000 MWh of electricity annually, the equivalent of powering 950 homes or avoiding 5,516 tons of carbon dioxide each year. Community Energy is the developer of the Keystone Solar Project and is working in partnership with Exelon Generation, the wholesale off-taker on the project. Juniata College joins the Clean Air Council, Drexel University, Franklin & Marshall College, Millersville University, Marywood University and Eastern University as a charter customer. \"This will give Juniata graduates a strong competitive edge in the emerging clean sector,\" said Jay Carlis, VP of Community Energy's Retail Division. About Community Energy, Inc. Community Energy, Inc. (CEI) has been leading renewable energy development since its founding in 1999. By launching the market for direct sales of renewable energy to retail electric customers, CEI first leveraged electric choice to build demand for new renewable projects, and went on to deliver wind energy at significant scale. In 2009, CEI expanded into solar project development, focusing on solar generation at both utility and customer scale in advancing solar markets. CEI continues to lead the industry by offering the full economic and environmental advantages of solar and wind energy to its array of customers and utility partners. Company projects include the Bear Creek Wind Farm, a 24 megawatt project in built in 2006 in Pennsylvania's Pocono Mountains and a 7.8 megawatt Vineland Solar Project in the City of Vineland, N.J. For more information, visit www.CommunityEnergyInc. com. About Juniata College Founded in 1876, Juniata is an independent, co-educational college of liberal arts and sciences. Located in the scenic mountains of central Pennsylvania, the beautiful 110-acre main campus is supplemented by the 365-acre Baker-Henry Nature Preserve and Baker Peace Chapel. In addition, a 365-acre Environmental Studies Field Station on nearby Raystown Lake provides one of the most distinctive opportunities in environmental science in the nation. The college has a strong reputation for excellent academics, personal attention, and state-ofthe art technological resources. Juniata students enjoy small classes, a challenging, flexible curriculum, collaborative student faculty relationships, countless chances to learn by doing and a lively campus offering lots to do and great new friends. The campus is located at 1700 Moore St., Huntingdon Juniata enrolls about 1,619 students in its undergraduate and graduate programs. Visit: www.juniata.edu. Copyright © 2012 The Daily News, All rights reserved. Citation (aglc Style) '', Daily News, The (online), 17 Dec 2012 ‹https://infoweb.newsbank.com/apps/news/document-view?p=WORLDNEWS&docref=news/16408B3D7130A2D8› ",
    "Elizabeth Skrapits (Staff Writer), 'Local utilities prepare equipment for hurricane-force winds, rain', Citizen's Voice, The & Sunday\nVoice (online), 30 Oct 2012 ‹https://infoweb.newsbank.com/apps/news/document-view?\np=WORLDNEWS&docref=news/14240945644677F0›\n": " Northeastern Pennsylvania's energy producers took steps to secure their facilities in advance of Hurricane Sandy's arrival. Wind For wind farms, a hurricane can be too much for the turbines that produce the energy. David Smith, spokesman for Infigen Energy which co-owns and operates the Bear Creek Wind Farm, said its 12 turbines are designed to withstand the weather conditions and the company is taking precautions recommended by their manufacturer. \"They have a specific set point where if it's too windy, they'll stop. You don't want the wind over-speeding the generator,\" he said. \"The blades adjust to let the wind flow past them.\" The turbines are monitored around the clock from Infigen's Dallas, Texas, facility, and Smith said there are local personnel who live within 20 minutes of the Bear Creek site. The National Weather Service predicted winds with sustained speeds of 30 to 40 mph Monday into Tuesday, with gusts of up to 70 mph. Smith believes the Bear Creek turbines can withstand those wind levels, but it all depends on how long the gusts are sustained. \"We'll be watching the site, obviously, overnight, and we'll do any assessments if necessary in the morning,\" he said Monday afternoon. The construction site where BP Wind Energy and Sempra U.S. Gas and Power are developing a series of 88 wind turbines from Noxen to Mehoopany is secured and personnel was evacuated, BP spokeswoman Amanda Abbott said. She said there are 27 completely erected turbines, but they are not commissioned to operate yet. A post-storm evaluation team will return to the site when it is safe to do so and undertake an assessment before personnel return and work resumes, Abbott said. Nuclear PPL Spokesman Joe Scopelliti doesn't expect problems at the Susquehanna Steam nuclear power plant in Salem Township. He said everything outside the plant was secured, and personnel reviewed the emergency plan. \"It's basically business as usual, except we're keeping an eye on the storm,\" Scopelliti said. Natural gas Williams, which owns natural gas-related infrastructure such as compressor stations and the Transco interstate pipeline in Dallas Township, said the company is \"securing everything at our various facilities,\" spokeswoman Helen Humphreys said. October 30, 2012 | Citizen's Voice, The & Sunday Voice (Wilkes-Barre, PA) Author: Elizabeth Skrapits (Staff Writer)  Section: Local  443 Words OpenURL Link  Northeastern Pennsylvania's energy producers took steps to secure their facilities in advance of Hurricane Sandy's arrival. Wind For wind farms, a hurricane can be too much for the turbines that produce the energy. David Smith, spokesman for Infigen Energy which co-owns and operates the Bear Creek Wind Farm, said its 12 turbines are designed to withstand the weather conditions and the company is taking precautions recommended by their manufacturer. \"They have a specific set point where if it's too windy, they'll stop. You don't want the wind over-speeding the generator,\" he said. \"The blades adjust to let the wind flow past them.\" The turbines are monitored around the clock from Infigen's Dallas, Texas, facility, and Smith said there are local personnel who live within 20 minutes of the Bear Creek site. The National Weather Service predicted winds with sustained speeds of 30 to 40 mph Monday into Tuesday, with gusts of up to 70 mph. Smith believes the Bear Creek turbines can withstand those wind levels, but it all depends on how long the gusts are sustained. \"We'll be watching the site, obviously, overnight, and we'll do any assessments if necessary in the morning,\" he said Monday afternoon. The construction site where BP Wind Energy and Sempra U.S. Gas and Power are developing a series of 88 wind turbines from Noxen to Mehoopany is secured and personnel was evacuated, BP spokeswoman Amanda Abbott said. She said there are 27 completely erected turbines, but they are not commissioned to operate yet. A post-storm evaluation team will return to the site when it is safe to do so and undertake an assessment before personnel return and work resumes, Abbott said. Nuclear PPL Spokesman Joe Scopelliti doesn't expect problems at the Susquehanna Steam nuclear power plant in Salem Township. He said everything outside the plant was secured, and personnel reviewed the emergency plan. \"It's basically business as usual, except we're keeping an eye on the storm,\" Scopelliti said. Natural gas Williams, which owns natural gas-related infrastructure such as compressor stations and the Transco interstate pipeline in Dallas Township, said the company is \"securing everything at our various facilities,\" spokeswoman Helen Humphreys said. October 30, 2012 | Citizen's Voice, The & Sunday Voice (Wilkes-Barre, PA) Author: Elizabeth Skrapits (Staff Writer)  Section: Local  443 Words OpenURL Link Natural gas powers compressor engines, but other equipment is run by electricity, so personnel are making sure there are generators at the facilities, she said. Pipelines are underground, and weather doesn't pose a risk to them, Humphreys said. She said the gas facilities and the equipment in them are built to withstand severe weather. Cabot Oil & Gas spokesman George Stark said drilling rigs can be laid down so they are not exposed, but they are built to withstand up to 95 mph sustained winds. eskrapits@citizensvoice.com, 570-821-2072 ",
    "JAY MONAHAN For The Times Leader, 'Cyclists savor Saturday rides', Times Leader, The (online), 8 May 2011 3C\n‹https://infoweb.newsbank.com/apps/news/document-view?p=WORLDNEWS&docref=news/1371A0021D37D7D8›\n": " WILKES-BARRE - When Tom Jones first started Around Town Bikes' bicycling group rides, there wasn't much of a group. Jones, his business partner Rich Adams and a friend were the only ones cycling along on the shoulders of roads every Saturday morning. Seven years later, the Saturday Morning Rides have grown to 30 to 60 cyclists who ride at an average pace of 14 mph. Jones, a co-owner of Around Town Bikes, said that the cycling season last 26 weeks - from April to October. The Saturday Morning Rides begin at 8 a.m. at Around Town Bikes on North Main Street in Wilkes-Barre. The group varies between two circuitous, round-trip routes: a north path that travels to Pittston and a south course that ventures to Nanticoke. \"Then we keep going different extended routes from there basically,\" Jones said. \"We get to the same point north or south pretty much the same every week.\" There are two different packs to accommodate the different fitness conditions among the riders. The more advanced group treks 35-to-40 miles, while the other flock bikes 25 miles. Jones said as the cycling season progresses, he chooses more challenging, hilly courses to Montage Mountain and the Bear Creek wind farm. \"It's nice to see their fitness improve over the course of the year,\" said Jones. \"We see some people who struggled with 25 miles at the beginning of the season. It's a real challenge for them. It's a sense of accomplishment for them that at the end of the 26 weeks when they could ride 40 miles and tackle some big hills.\" The Saturday Morning Ride was inspired by a similar store ride that Jones participated in when he previously lived in Southern California. Like its inspiration, it has emerged into a social event. After the two-hour bike rides, the group eats a light breakfast together inside the store, with many cyclists milling around and socializing for more than hour. \"We really know each other well in the bike shop and from riding a bike,\" said Bob Kelly, of Kingston. \"They come from all backgrounds - die-hards, college students, women, doctors, lawyers, professionals, and people from all walks of life. You learn about other people. It's a nice mix.\" Jones said the group ranges from teens to 70s with the 73-year old Kelly being the eldest member. Kelly, who fell in love with cycling when he briefly lived in London, said that Around Town Bikes' Saturday Morning Rides has rejuvenated his love of the sport. \"Look at me - I'm fit,\" said Kelly, who was a licensed coach for the U.S. Cycling Federation. \"I'm as old as Superman. I'm 10 years younger than Mickey Mouse - that's Steamboat Willy I'm talking about. And I can go out and ride 50 miles with ease.\" Despite his age, Kelly sticks with the \"fast group,\" drafting and coasting off the skilled riders. Jones and Adams formed Around Town Bikes seven years ago in a former print shop off Public Square. Kelly said it's the kind of bicycle shop that you don't see very often. May 8, 2011 | Times Leader, The (Wilkes-Barre, PA) Author: JAY MONAHAN For The Times Leader  Section: C  670 Words Page: 3C OpenURL Link  WILKES-BARRE - When Tom Jones first started Around Town Bikes' bicycling group rides, there wasn't much of a group. Jones, his business partner Rich Adams and a friend were the only ones cycling along on the shoulders of roads every Saturday morning. Seven years later, the Saturday Morning Rides have grown to 30 to 60 cyclists who ride at an average pace of 14 mph. Jones, a co-owner of Around Town Bikes, said that the cycling season last 26 weeks - from April to October. The Saturday Morning Rides begin at 8 a.m. at Around Town Bikes on North Main Street in Wilkes-Barre. The group varies between two circuitous, round-trip routes: a north path that travels to Pittston and a south course that ventures to Nanticoke. \"Then we keep going different extended routes from there basically,\" Jones said. \"We get to the same point north or south pretty much the same every week.\" There are two different packs to accommodate the different fitness conditions among the riders. The more advanced group treks 35-to-40 miles, while the other flock bikes 25 miles. Jones said as the cycling season progresses, he chooses more challenging, hilly courses to Montage Mountain and the Bear Creek wind farm. \"It's nice to see their fitness improve over the course of the year,\" said Jones. \"We see some people who struggled with 25 miles at the beginning of the season. It's a real challenge for them. It's a sense of accomplishment for them that at the end of the 26 weeks when they could ride 40 miles and tackle some big hills.\" The Saturday Morning Ride was inspired by a similar store ride that Jones participated in when he previously lived in Southern California. Like its inspiration, it has emerged into a social event. After the two-hour bike rides, the group eats a light breakfast together inside the store, with many cyclists milling around and socializing for more than hour. \"We really know each other well in the bike shop and from riding a bike,\" said Bob Kelly, of Kingston. \"They come from all backgrounds - die-hards, college students, women, doctors, lawyers, professionals, and people from all walks of life. You learn about other people. It's a nice mix.\" Jones said the group ranges from teens to 70s with the 73-year old Kelly being the eldest member. Kelly, who fell in love with cycling when he briefly lived in London, said that Around Town Bikes' Saturday Morning Rides has rejuvenated his love of the sport. \"Look at me - I'm fit,\" said Kelly, who was a licensed coach for the U.S. Cycling Federation. \"I'm as old as Superman. I'm 10 years younger than Mickey Mouse - that's Steamboat Willy I'm talking about. And I can go out and ride 50 miles with ease.\" Despite his age, Kelly sticks with the \"fast group,\" drafting and coasting off the skilled riders. Jones and Adams formed Around Town Bikes seven years ago in a former print shop off Public Square. Kelly said it's the kind of bicycle shop that you don't see very often. May 8, 2011 | Times Leader, The (Wilkes-Barre, PA) Author: JAY MONAHAN For The Times Leader  Section: C  670 Words Page: 3C OpenURL Link \"It's unique because it's like the old-fashioned barbershops where you can go in and talk to everybody and learn about cycling and network,\" said Kelly. \"Most bike shops are more like retail stores but this is like the old barbershops.\" Sickler's Bike & Sport Shop in Clarks Summit also runs rides four days per week in Lackawanna County. Upstate Velo, a newly formed cycling club, showcases rides for members on Wednesday evenings in Harveys Lake. Cyclist Bobby Angeli, of Plains Township, said \"there is a little bit of camaraderie and a little bit of friendly, unwritten competition between the riders.\" Though the Saturday Morning Rides is only in its seventh season, Jones said that a cycling community has always been present in the area, though he finds it refreshing to see other enthusiasts on the asphalt with him. \"It kept building and building and building. The nice part is that sometimes we get 50 or 60 riders. It's not the same with 50 or 60 riders as it is with three. It's quite a large body of riders out there.\"</ ",
    "JAY MONAHAN For The Times Leader, 'Cyclists savor Saturday rides', Times Leader, The (online), 8 May 2011 3C\n‹https://infoweb.newsbank.com/apps/news/document-view?p=WORLDNEWS&docref=news/1371A0039AC89910›\n": " WILKES-BARRE - When Tom Jones first started Around Town Bikes' bicycling group rides, there wasn't much of a group. Jones, his business partner Rich Adams and a friend were the only ones cycling along on the shoulders of roads every Saturday morning. Seven years later, the Saturday Morning Rides have grown to 30 to 60 cyclists who ride at an average pace of 14 mph. Jones, a co-owner of Around Town Bikes, said that the cycling season last 26 weeks - from April to October. The Saturday Morning Rides begin at 8 a.m. at Around Town Bikes on North Main Street in Wilkes-Barre. The group varies between two circuitous, round-trip routes: a north path that travels to Pittston and a south course that ventures to Nanticoke. \"Then we keep going different extended routes from there basically,\" Jones said. \"We get to the same point north or south pretty much the same every week.\" There are two different packs to accommodate the different fitness conditions among the riders. The more advanced group treks 35-to-40 miles, while the other flock bikes 25 miles. Jones said as the cycling season progresses, he chooses more challenging, hilly courses to Montage Mountain and the Bear Creek wind farm. \"It's nice to see their fitness improve over the course of the year,\" said Jones. \"We see some people who struggled with 25 miles at the beginning of the season. It's a real challenge for them. It's a sense of accomplishment for them that at the end of the 26 weeks when they could ride 40 miles and tackle some big hills.\" The Saturday Morning Ride was inspired by a similar store ride that Jones participated in when he previously lived in Southern California. Like its inspiration, it has emerged into a social event. After the two-hour bike rides, the group eats a light breakfast together inside the store, with many cyclists milling around and socializing for more than hour. \"We really know each other well in the bike shop and from riding a bike,\" said Bob Kelly, of Kingston. \"They come from all backgrounds - die-hards, college students, women, doctors, lawyers, professionals, and people from all walks of life. You learn about other people. It's a nice mix.\" Jones said the group ranges from teens to 70s with the 73-year old Kelly being the eldest member. Kelly, who fell in love with cycling when he briefly lived in London, said that Around Town Bikes' Saturday Morning Rides has rejuvenated his love of the sport. \"Look at me - I'm fit,\" said Kelly, who was a licensed coach for the U.S. Cycling Federation. \"I'm as old as Superman. I'm 10 years younger than Mickey Mouse - that's Steamboat Willy I'm talking about. And I can go out and ride 50 miles with ease.\" Despite his age, Kelly sticks with the \"fast group,\" drafting and coasting off the skilled riders. Jones and Adams formed Around Town Bikes seven years ago in a former print shop off Public Square. Kelly said it's the kind of bicycle shop that you don't see very often. May 8, 2011 | Times Leader, The (Wilkes-Barre, PA) Author: JAY MONAHAN For The Times Leader  Section: C  670 Words Page: 3C OpenURL Link  WILKES-BARRE - When Tom Jones first started Around Town Bikes' bicycling group rides, there wasn't much of a group. Jones, his business partner Rich Adams and a friend were the only ones cycling along on the shoulders of roads every Saturday morning. Seven years later, the Saturday Morning Rides have grown to 30 to 60 cyclists who ride at an average pace of 14 mph. Jones, a co-owner of Around Town Bikes, said that the cycling season last 26 weeks - from April to October. The Saturday Morning Rides begin at 8 a.m. at Around Town Bikes on North Main Street in Wilkes-Barre. The group varies between two circuitous, round-trip routes: a north path that travels to Pittston and a south course that ventures to Nanticoke. \"Then we keep going different extended routes from there basically,\" Jones said. \"We get to the same point north or south pretty much the same every week.\" There are two different packs to accommodate the different fitness conditions among the riders. The more advanced group treks 35-to-40 miles, while the other flock bikes 25 miles. Jones said as the cycling season progresses, he chooses more challenging, hilly courses to Montage Mountain and the Bear Creek wind farm. \"It's nice to see their fitness improve over the course of the year,\" said Jones. \"We see some people who struggled with 25 miles at the beginning of the season. It's a real challenge for them. It's a sense of accomplishment for them that at the end of the 26 weeks when they could ride 40 miles and tackle some big hills.\" The Saturday Morning Ride was inspired by a similar store ride that Jones participated in when he previously lived in Southern California. Like its inspiration, it has emerged into a social event. After the two-hour bike rides, the group eats a light breakfast together inside the store, with many cyclists milling around and socializing for more than hour. \"We really know each other well in the bike shop and from riding a bike,\" said Bob Kelly, of Kingston. \"They come from all backgrounds - die-hards, college students, women, doctors, lawyers, professionals, and people from all walks of life. You learn about other people. It's a nice mix.\" Jones said the group ranges from teens to 70s with the 73-year old Kelly being the eldest member. Kelly, who fell in love with cycling when he briefly lived in London, said that Around Town Bikes' Saturday Morning Rides has rejuvenated his love of the sport. \"Look at me - I'm fit,\" said Kelly, who was a licensed coach for the U.S. Cycling Federation. \"I'm as old as Superman. I'm 10 years younger than Mickey Mouse - that's Steamboat Willy I'm talking about. And I can go out and ride 50 miles with ease.\" Despite his age, Kelly sticks with the \"fast group,\" drafting and coasting off the skilled riders. Jones and Adams formed Around Town Bikes seven years ago in a former print shop off Public Square. Kelly said it's the kind of bicycle shop that you don't see very often. May 8, 2011 | Times Leader, The (Wilkes-Barre, PA) Author: JAY MONAHAN For The Times Leader  Section: C  670 Words Page: 3C OpenURL Link \"It's unique because it's like the old-fashioned barbershops where you can go in and talk to everybody and learn about cycling and network,\" said Kelly. \"Most bike shops are more like retail stores but this is like the old barbershops.\" Sickler's Bike & Sport Shop in Clarks Summit also runs rides four days per week in Lackawanna County. Upstate Velo, a newly formed cycling club, showcases rides for members on Wednesday evenings in Harveys Lake. Cyclist Bobby Angeli, of Plains Township, said \"there is a little bit of camaraderie and a little bit of friendly, unwritten competition between the riders.\" Though the Saturday Morning Rides is only in its seventh season, Jones said that a cycling community has always been present in the area, though he finds it refreshing to see other enthusiasts on the asphalt with him. \"It kept building and building and building. The nice part is that sometimes we get 50 or 60 riders. It's not the same with 50 or 60 riders as it is with three. It's quite a large body of riders out there.\"</ ",
    "LESLIE RICHARDSON, STAFF WRITER lrichardson@republ, 'Alliance to host wind energy confab', Pottsville Republican, The &\nEvening Herald (online), 15 Mar 2010 1 ‹https://infoweb.newsbank.com/apps/news/document-view?\np=WORLDNEWS&docref=news/12E79ED038558628›\n": " The Northeastern Pennsylvania Alliance will host an invitation-only wind energy conference Friday at the Woodlands Inn and Resort, Wilkes-Barre. The event will feature up to 12 speakers, including lawmakers, private business owners and local government officials - including Mahanoy Township supervisors Chairwoman Sharon Chiao - focusing on wind turbine projects across the state. A tour of Bear Creek Wind Farm, Bear Creek Township, is also planned. \"We are targeting local government officials and are hoping that by providing them with information about wind farm projects, it will help them make sound decisions about entities wanting to build wind turbines in their area,\" Kurt Bauman, the alliance's government services manager, said last week. Bauman said Chiao will speak and noted that the Locust Ridge Wind Farm is partially located in Mahanoy Township. A June 2008 story in The Republican-Herald stated the township received a stipend of $18,000 a year for the first 12 windmills. When approving plans for Phase II of the project, the township sought a $23,000 per year stipend. \"This was a very important project for us,\" Chiao said. \"We are trying to attract business and do what is right for our community and good for the environment.\" Other wind farms have been the topic of municipal meetings throughout Schuylkill County. Questions regarding environmental issues like the harm to birds and bats as well as noise have come before local government officials. In Tremont and Hegins townships, there's been an on-going discussion among citizens about BP Wind Energy's plans to construct windmills and develop the Rausch Creek Wind Farm by 2012. The proposal would include erecting 50 to 60 wind turbines on approximately 2,000 acres in Hegins, Porter, Tremont, and Frailey townships. The Hegins Township supervisors addressed several issues concerning windmills during a March meeting. According to township solicitor David Rattigan, under the township's current zoning, the windmills would not be permitted on top of the mountain. He said the only permitted place in the township would be the land in the industrial zone and on Dell Road near the former Penn Reel. The township would receive about $6,900 per year, Rattigan said. \"The school district would be receiving more because their millage is much higher than ours. According to the figures, the school would be receiving approximately $58,200 per year.\" Broad Mountain Development Co. LLC, Gilberton, a Rich family company wanting to build 27 wind turbines in the Fountain Springs area on Rich and Girard Estate land in Butler Township, filed an appeal in Schuylkill County Court March 2 alleging that Butler's zoning ordinance improperly does not allow wind turbines, that amendments supposedly enacted on Feb. 1 by the supervisors do not cure the problem to its satisfaction and that state law thereby entitles it to build the turbines on its property. In February, Broad Mountain Wind Energy Center was notified they will receive $5 million in federal stimulus money March 15, 2010 | Republican Herald (Pottsville, PA) Author: LESLIE RICHARDSON; STAFF WRITER lrichardson@republ  Section: A  518 Words Page: 1 OpenURL Link  The Northeastern Pennsylvania Alliance will host an invitation-only wind energy conference Friday at the Woodlands Inn and Resort, Wilkes-Barre. The event will feature up to 12 speakers, including lawmakers, private business owners and local government officials - including Mahanoy Township supervisors Chairwoman Sharon Chiao - focusing on wind turbine projects across the state. A tour of Bear Creek Wind Farm, Bear Creek Township, is also planned. \"We are targeting local government officials and are hoping that by providing them with information about wind farm projects, it will help them make sound decisions about entities wanting to build wind turbines in their area,\" Kurt Bauman, the alliance's government services manager, said last week. Bauman said Chiao will speak and noted that the Locust Ridge Wind Farm is partially located in Mahanoy Township. A June 2008 story in The Republican-Herald stated the township received a stipend of $18,000 a year for the first 12 windmills. When approving plans for Phase II of the project, the township sought a $23,000 per year stipend. \"This was a very important project for us,\" Chiao said. \"We are trying to attract business and do what is right for our community and good for the environment.\" Other wind farms have been the topic of municipal meetings throughout Schuylkill County. Questions regarding environmental issues like the harm to birds and bats as well as noise have come before local government officials. In Tremont and Hegins townships, there's been an on-going discussion among citizens about BP Wind Energy's plans to construct windmills and develop the Rausch Creek Wind Farm by 2012. The proposal would include erecting 50 to 60 wind turbines on approximately 2,000 acres in Hegins, Porter, Tremont, and Frailey townships. The Hegins Township supervisors addressed several issues concerning windmills during a March meeting. According to township solicitor David Rattigan, under the township's current zoning, the windmills would not be permitted on top of the mountain. He said the only permitted place in the township would be the land in the industrial zone and on Dell Road near the former Penn Reel. The township would receive about $6,900 per year, Rattigan said. \"The school district would be receiving more because their millage is much higher than ours. According to the figures, the school would be receiving approximately $58,200 per year.\" Broad Mountain Development Co. LLC, Gilberton, a Rich family company wanting to build 27 wind turbines in the Fountain Springs area on Rich and Girard Estate land in Butler Township, filed an appeal in Schuylkill County Court March 2 alleging that Butler's zoning ordinance improperly does not allow wind turbines, that amendments supposedly enacted on Feb. 1 by the supervisors do not cure the problem to its satisfaction and that state law thereby entitles it to build the turbines on its property. In February, Broad Mountain Wind Energy Center was notified they will receive $5 million in federal stimulus money March 15, 2010 | Republican Herald (Pottsville, PA) Author: LESLIE RICHARDSON; STAFF WRITER lrichardson@republ  Section: A  518 Words Page: 1 OpenURL Link to help construct 35 wind turbines, which will add 70 megawatts to the electrical grid generating system, as well as 100 local jobs. Once built, the project could have the potential to produce clean renewable electricity to about 21,000 homes, provide jobs and support local businesses. ",
    "LESLIE RICHARDSON, STAFF WRITER, 'N.E. Pa. Alliance to give presentation on wind energy', Standard-Speaker (online), 15 Mar\n2010 5 ‹https://infoweb.newsbank.com/apps/news/document-view?p=WORLDNEWS&docref=news/12E8319DF8CA6FD8›\n": " PITTSTON - The Northeastern Pennsylvania Alliance will host an invitation-only wind energy conference March 19 at the Woodlands Inn and Resort, Wilkes-Barre. The event will feature up to 12 speakers, including lawmakers, private business owners and local government officials - including Mahanoy Township supervisors Chairwoman Sharon Chiao - focusing about wind turbine projects across the state. A tour of Bear Creek Wind Farm, Bear Creek Township, is also planned. \"We are targeting local government officials and are hoping that by providing them with information about wind farm projects, it will help them make sound decisions about entities wanting to build wind turbines in their area,\" Kurt Bauman, the alliance's government services manager, said last week. Bauman said Chiao will speak and noted that the Locust Ridge Wind Farm is partially located in Mahanoy Township. A June 2008 story in the Standard-Speaker stated the township received a stipend of $18,000 a year for the first 12 windmills. When approving plans for Phase II of the project, the township sought a $23,000 per year stipend. \"This was a very important project for us,\" Chiao said. \"We are trying to attract business and do what is right for our community and good for the environment.\" Locust Ridge is owned by Iberdola Renewable Energies USA, the world's largest owner and operator of renewable energy facilities.' Other wind farms have been the topic of municipal meetings throughout Schuylkill County. Questions regarding environmental issues like the harm to birds and bats as well as noise have come before local government officials. In Tremont and Hegins townships, there's been an on-going discussion among citizens about BP Wind Energy's plans to construct windmills and develop the Rausch Creek Wind Farm by 2012. The proposal would include erecting 50 to 60 wind turbines on approximately 2,000 acres in Hegins, Porter, Tremont, and Frailey townships. The Hegins Township supervisors addressed several issues concerning windmills during a March meeting. According to township solicitor David Rattigan, under the township's current zoning, the windmills would not be permitted on top of the mountain. He said the only permitted place in the township would be the land in the industrial zone and on Dell Road near the former Penn Reel. The township would receive about $6,900 per year, Rattigan said. \"The school district would be receiving more because their millage is much higher than ours. According to the figures, the school would be receiving approximately $58,200 per year.\" Broad Mountain Development Co. LLC, Gilberton, a Rich family company wanting to build 27 wind turbines in the Fountain Springs area on Rich and Girard Estate land in Butler Township, filed an appeal in Schuylkill County Court March 2 alleging that Butler's zoning ordinance improperly does not allow wind turbines, that amendments supposedly enacted on Feb. 1 by the supervisors do not cure the problem to its satisfaction and that state law March 15, 2010 | Standard-Speaker (Hazleton, PA) Author: LESLIE RICHARDSON; STAFF WRITER  Section: A  540 Words Page: 5 OpenURL Link  PITTSTON - The Northeastern Pennsylvania Alliance will host an invitation-only wind energy conference March 19 at the Woodlands Inn and Resort, Wilkes-Barre. The event will feature up to 12 speakers, including lawmakers, private business owners and local government officials - including Mahanoy Township supervisors Chairwoman Sharon Chiao - focusing about wind turbine projects across the state. A tour of Bear Creek Wind Farm, Bear Creek Township, is also planned. \"We are targeting local government officials and are hoping that by providing them with information about wind farm projects, it will help them make sound decisions about entities wanting to build wind turbines in their area,\" Kurt Bauman, the alliance's government services manager, said last week. Bauman said Chiao will speak and noted that the Locust Ridge Wind Farm is partially located in Mahanoy Township. A June 2008 story in the Standard-Speaker stated the township received a stipend of $18,000 a year for the first 12 windmills. When approving plans for Phase II of the project, the township sought a $23,000 per year stipend. \"This was a very important project for us,\" Chiao said. \"We are trying to attract business and do what is right for our community and good for the environment.\" Locust Ridge is owned by Iberdola Renewable Energies USA, the world's largest owner and operator of renewable energy facilities.' Other wind farms have been the topic of municipal meetings throughout Schuylkill County. Questions regarding environmental issues like the harm to birds and bats as well as noise have come before local government officials. In Tremont and Hegins townships, there's been an on-going discussion among citizens about BP Wind Energy's plans to construct windmills and develop the Rausch Creek Wind Farm by 2012. The proposal would include erecting 50 to 60 wind turbines on approximately 2,000 acres in Hegins, Porter, Tremont, and Frailey townships. The Hegins Township supervisors addressed several issues concerning windmills during a March meeting. According to township solicitor David Rattigan, under the township's current zoning, the windmills would not be permitted on top of the mountain. He said the only permitted place in the township would be the land in the industrial zone and on Dell Road near the former Penn Reel. The township would receive about $6,900 per year, Rattigan said. \"The school district would be receiving more because their millage is much higher than ours. According to the figures, the school would be receiving approximately $58,200 per year.\" Broad Mountain Development Co. LLC, Gilberton, a Rich family company wanting to build 27 wind turbines in the Fountain Springs area on Rich and Girard Estate land in Butler Township, filed an appeal in Schuylkill County Court March 2 alleging that Butler's zoning ordinance improperly does not allow wind turbines, that amendments supposedly enacted on Feb. 1 by the supervisors do not cure the problem to its satisfaction and that state law March 15, 2010 | Standard-Speaker (Hazleton, PA) Author: LESLIE RICHARDSON; STAFF WRITER  Section: A  540 Words Page: 5 OpenURL Link thereby entitles it to build the turbines on its property. In February, Broad Mountain Wind Energy Center was notified they will receive $5 million in federal stimulus money to help construct 35 wind turbines, which will add 70 megawatts to the electrical grid generating system, as well as 100 local jobs. Once built, the project could have the potential to produce clean renewable electricity to about 21,000 homes, provide jobs and support local businesses. lrichardson@republicanherald.com Copyright, 2010, Standard-Speaker, All Rights Reserved. Citation (aglc Style) LESLIE RICHARDSON, STAFF WRITER, '', Standard-Speaker (online), 15 Mar 2010 5 ‹https://infoweb.newsbank.com/apps/news/document-view?p=WORLDNEWS&docref=news/12E8319DF8CA6FD8› ",
    "AMANDA CHRISTMAN, STAFF WRITER, 'Bear Creek offers example for municipalities considering wind farms', Standard-Speaker\n(online), 28 Dec 2009 1 ‹https://infoweb.newsbank.com/apps/news/document-view?\np=WORLDNEWS&docref=news/12CE7E55D4829858›\n": " BEAR CREEK TOWNSHIP - High atop of a mountain in Bear Creek sits a $53 million investment. Construction of the wind turbine farm began in 2005 and was finished in March 2006. Since then, the farm has been supplying energy when the wind blows. At 2,800 feet above sea level on 130 acres of land operated by Bluarc Management Group and Community Energy, Bear Creek Wind Farm has the capacity to create 24 megawatts of power each year, Todd Solliday, project manager, said. Bear Creek, he said, usually operates at 30 percent capacity until the winter months when winds are stronger and it runs near 70 percent capacity. The farm, Solliday said, creates enough energy to power about 7,200 homes for a year. All 12 Gamesa brand turbines that stand on Bald Mountain cost about $2 million each. In November, at turbine No. 8, wind pushed the massive blades, creating a dull \"whoosh\" sound. The wind was calculated to be blowing at 9 mph that day. Each tower weighs 190 tons and each rotor weighs 102 tons. From the base to the center of the control hub, a turbine measures 256 feet. Each blade, weighing 7 tons, is 139 feet long from tip to base. The rotor diameter is 286 feet. Wind farms receive a tax credit based on wind output and the units of electricity generated. Jay Carlis, vice president of sales and management at Community Energy, Radnor, said government funding for alternative energy projects comes and goes. He said generally wind farms don't make money in the first year of operation because so much is spent to build them. He said it is \"a big capital investment\" that won't see payback for seven to 10 years. A Sunbury firm plans to build a farm on top of Buck Mountain in Black Creek Township, Luzerne County and Beaver Township, Columbia County, once it receives the necessary government approvals. Twenty-two turbines will be installed, four of them will be in Black Creek. When Penn Wind originally submitted its plans to Black Creek, several residents showed concern for environmental, safety and financial impacts. The Freeland Municipal Sewer and Water Authority this month entered into a lease agreement with enXco of California for a potential wind farm. Studies testing wind speed and capacity are currently taking place on 500 acres of authority-owned land in Upper Lehigh, Foster Township. Misconceptions There are plenty of concerns about wind farms. There are also plenty of misconceptions, according to Solliday and Carlis. Just searching for the phrase \"wind farm\" on YouTube.com pulls up videos of dangerous and sometimes catastrophic events surrounding turbines. December 28, 2009 | Standard-Speaker (Hazleton, PA) Author: AMANDA CHRISTMAN; STAFF WRITER  Section: A  1461 Words Page: 1 OpenURL Link  BEAR CREEK TOWNSHIP - High atop of a mountain in Bear Creek sits a $53 million investment. Construction of the wind turbine farm began in 2005 and was finished in March 2006. Since then, the farm has been supplying energy when the wind blows. At 2,800 feet above sea level on 130 acres of land operated by Bluarc Management Group and Community Energy, Bear Creek Wind Farm has the capacity to create 24 megawatts of power each year, Todd Solliday, project manager, said. Bear Creek, he said, usually operates at 30 percent capacity until the winter months when winds are stronger and it runs near 70 percent capacity. The farm, Solliday said, creates enough energy to power about 7,200 homes for a year. All 12 Gamesa brand turbines that stand on Bald Mountain cost about $2 million each. In November, at turbine No. 8, wind pushed the massive blades, creating a dull \"whoosh\" sound. The wind was calculated to be blowing at 9 mph that day. Each tower weighs 190 tons and each rotor weighs 102 tons. From the base to the center of the control hub, a turbine measures 256 feet. Each blade, weighing 7 tons, is 139 feet long from tip to base. The rotor diameter is 286 feet. Wind farms receive a tax credit based on wind output and the units of electricity generated. Jay Carlis, vice president of sales and management at Community Energy, Radnor, said government funding for alternative energy projects comes and goes. He said generally wind farms don't make money in the first year of operation because so much is spent to build them. He said it is \"a big capital investment\" that won't see payback for seven to 10 years. A Sunbury firm plans to build a farm on top of Buck Mountain in Black Creek Township, Luzerne County and Beaver Township, Columbia County, once it receives the necessary government approvals. Twenty-two turbines will be installed, four of them will be in Black Creek. When Penn Wind originally submitted its plans to Black Creek, several residents showed concern for environmental, safety and financial impacts. The Freeland Municipal Sewer and Water Authority this month entered into a lease agreement with enXco of California for a potential wind farm. Studies testing wind speed and capacity are currently taking place on 500 acres of authority-owned land in Upper Lehigh, Foster Township. Misconceptions There are plenty of concerns about wind farms. There are also plenty of misconceptions, according to Solliday and Carlis. Just searching for the phrase \"wind farm\" on YouTube.com pulls up videos of dangerous and sometimes catastrophic events surrounding turbines. December 28, 2009 | Standard-Speaker (Hazleton, PA) Author: AMANDA CHRISTMAN; STAFF WRITER  Section: A  1461 Words Page: 1 OpenURL Link \"Everyone sees it on YouTube but it can be compared to shark attacks because it's so random and rare,\" Carlis said. In one video, a turbine catches fire, engulfing the multi-million-dollar device in flames. Solliday said any time high-voltage electricity is involved there is always a possibility of fire, but wind farm companies do what they can to mitigate the risks. \"We don't want a $2 million turbine to burn down,\" Solliday said. Another video shows a turbine in Denmark exploding into pieces, scattering debris across the landscape. Solliday said the same thing happened a few years ago in Oklahoma. He said those instances usually occur after a technician overrides the turbine's braking system. He said automatic brakes are designed to stop the turbine if it begins to move too quickly to prevent explosion. Then there's the video of ice built up on the turbine's blades being flung from the massive devices. Solliday said the Bear Creek site already has been shut down and the turbines turned off until ice melts from the blades. He said ice buildup typically won't allow the rotor to move when the wind blows because of the ice weight. Also, Carlis said, wind farms are typically built far enough away from communities to prevent injury or damage to people and property. What about winged creatures getting caught in the turbines' blades? Carlis said wind power contributes to fewer bird fatalities than natural causes. He said a study showed turbines killed 75,000 birds in a year, while birds flying into windows contributed to between 100 million and 1 billion deaths and cats contributed to between 100 million and 500 million in a year. The benefits Electricity produced by the wind farms will offset the amount of emissions released by conventional generation, providing greener energy resources, Carlis said. There is no need for fuel, ash removal or water treatment chemicals at a wind farm, he said, creating a safer environment. Solliday said it costs less to operate a wind farm because less staff is needed than at a traditional energy plant. Power from Bear Creek is used by PPL Energy Group, a deregulated arm of PPL Utilities, Carlis said. PPL and the wind farm entered into a 20-year power-purchase agreement. PPL spokeswoman Lisette Santana said the company purchases between 52,000 and 59,000 megawatt-hours of energy from Bear Creek each year. It also purchases between 57,000 and 64,000 megawatt-hours of power annually from Locust Ridge, a 26 megawatt wind farm in Schuylkill County. The addition of wind farms as PPL's energy sources won't prevent electric rate increases but is an important part of how electricity is generated because it is emission-free, Santana said. About 10 percent of PPL's energy comes from renewable projects, such as wind farms, hydroelectric, bio-gas landfills and solar plants. Santana said turbines aren't reliable as a sole source of energy due to the wind being intermittent. When the wind isn't blowing, power isn't generated from turbines, she said. But as the years progress, she said, alternative energy will be improved and upgrades will be made to PPL infrastructure to create more efficient alternative-energy transmission. \"Everyone sees it on YouTube but it can be compared to shark attacks because it's so random and rare,\" Carlis said. In one video, a turbine catches fire, engulfing the multi-million-dollar device in flames. Solliday said any time high-voltage electricity is involved there is always a possibility of fire, but wind farm companies do what they can to mitigate the risks. \"We don't want a $2 million turbine to burn down,\" Solliday said. Another video shows a turbine in Denmark exploding into pieces, scattering debris across the landscape. Solliday said the same thing happened a few years ago in Oklahoma. He said those instances usually occur after a technician overrides the turbine's braking system. He said automatic brakes are designed to stop the turbine if it begins to move too quickly to prevent explosion. Then there's the video of ice built up on the turbine's blades being flung from the massive devices. Solliday said the Bear Creek site already has been shut down and the turbines turned off until ice melts from the blades. He said ice buildup typically won't allow the rotor to move when the wind blows because of the ice weight. Also, Carlis said, wind farms are typically built far enough away from communities to prevent injury or damage to people and property. What about winged creatures getting caught in the turbines' blades? Carlis said wind power contributes to fewer bird fatalities than natural causes. He said a study showed turbines killed 75,000 birds in a year, while birds flying into windows contributed to between 100 million and 1 billion deaths and cats contributed to between 100 million and 500 million in a year. The benefits Electricity produced by the wind farms will offset the amount of emissions released by conventional generation, providing greener energy resources, Carlis said. There is no need for fuel, ash removal or water treatment chemicals at a wind farm, he said, creating a safer environment. Solliday said it costs less to operate a wind farm because less staff is needed than at a traditional energy plant. Power from Bear Creek is used by PPL Energy Group, a deregulated arm of PPL Utilities, Carlis said. PPL and the wind farm entered into a 20-year power-purchase agreement. PPL spokeswoman Lisette Santana said the company purchases between 52,000 and 59,000 megawatt-hours of energy from Bear Creek each year. It also purchases between 57,000 and 64,000 megawatt-hours of power annually from Locust Ridge, a 26 megawatt wind farm in Schuylkill County. The addition of wind farms as PPL's energy sources won't prevent electric rate increases but is an important part of how electricity is generated because it is emission-free, Santana said. About 10 percent of PPL's energy comes from renewable projects, such as wind farms, hydroelectric, bio-gas landfills and solar plants. Santana said turbines aren't reliable as a sole source of energy due to the wind being intermittent. When the wind isn't blowing, power isn't generated from turbines, she said. But as the years progress, she said, alternative energy will be improved and upgrades will be made to PPL infrastructure to create more efficient alternative-energy transmission. Wind farms, Carlis said, create jobs for turbine manufacturing in the United States. As the industry grows so will the number of jobs, Carlis said. People traveling for work on wind farms also use local hotels and patronize local businesses, he said. \"It creates a ripple effect in the host community,\" Carlis said. Officials' views Bear Creek Township Supervisors Chairman Gary M. Zingaretti wasn't on the board when the wind farm project was submitted to the township but he lives right next to the access road for the site. He said he can hear noise at his home from the turbines spinning. The closest one to his house is about two-thirds of a mile away. Zingaretti said people in other areas have said the turbines get very loud at times, but since he has been a supervisor for the past two years there have been very few complaints. The township recently amended its wind farm ordinance to prevent future wind farms from being built too close to homes, he said. He said all municipalities should have a wind turbine ordinance in place to protect the community and prevent environmental and safety concerns. He said when the news hit of a wind turbine farm there was a concern for safety, health and quality-of-life issues. Residents, Zingaretti said, should research the track record of a wind turbine developer interested in breaking ground in their hometown. Zingaretti said the Bear Creek developer made it known early on that they wanted to be \"a good neighbor\" and fixed problems residents complained about, such as water runoff. The township, he said, set up a contract with the developer and reaps a yearly per-turbine fee that started at $2,500 during the first year of operation. With inflation that number grew to the present-day per-turbine fee of $3,000 annually. Last year, Zingaretti said, the township received $36,000 in revenue for the turbines. \"It certainly helps financially to have that in the township. Obviously, that's $36,000 we don't have to get from our residents,\" he said. The few employees at the wind farm, he said, also contribute to tax revenue. Planning commission Vice Chairman Richard Kresge Jr., said there are pros and cons to wind farms. From an energy production standpoint and from an additional revenue source for municipalities, wind turbines are a benefit. However, he said there are those that argue the wind farm changed the character of the rural township by affecting aesthetics. He said in Bear Creek, it seemed once residents caught wind of the turbine project, they had questions and concerns for it but it was too far along in the development process to address some of them. He said residents should come to all public meetings held on wind farm developments early on and be informed of those meetings with ample time. Kresge recommended municipalities to ensure developers go through the proper subdivision and land development process in municipalities and to involve the public early on. \"If there's any recommendation I can give is go through the proper channels,\" he said. \"Go through planning, zoning and public participation. And then at the end of the day if they can demonstrate they can address the concerns of the township regulations I think it could be a positive thing,\" he said. Wind farms, Carlis said, create jobs for turbine manufacturing in the United States. As the industry grows so will the number of jobs, Carlis said. People traveling for work on wind farms also use local hotels and patronize local businesses, he said. \"It creates a ripple effect in the host community,\" Carlis said. Officials' views Bear Creek Township Supervisors Chairman Gary M. Zingaretti wasn't on the board when the wind farm project was submitted to the township but he lives right next to the access road for the site. He said he can hear noise at his home from the turbines spinning. The closest one to his house is about two-thirds of a mile away. Zingaretti said people in other areas have said the turbines get very loud at times, but since he has been a supervisor for the past two years there have been very few complaints. The township recently amended its wind farm ordinance to prevent future wind farms from being built too close to homes, he said. He said all municipalities should have a wind turbine ordinance in place to protect the community and prevent environmental and safety concerns. He said when the news hit of a wind turbine farm there was a concern for safety, health and quality-of-life issues. Residents, Zingaretti said, should research the track record of a wind turbine developer interested in breaking ground in their hometown. Zingaretti said the Bear Creek developer made it known early on that they wanted to be \"a good neighbor\" and fixed problems residents complained about, such as water runoff. The township, he said, set up a contract with the developer and reaps a yearly per-turbine fee that started at $2,500 during the first year of operation. With inflation that number grew to the present-day per-turbine fee of $3,000 annually. Last year, Zingaretti said, the township received $36,000 in revenue for the turbines. \"It certainly helps financially to have that in the township. Obviously, that's $36,000 we don't have to get from our residents,\" he said. The few employees at the wind farm, he said, also contribute to tax revenue. Planning commission Vice Chairman Richard Kresge Jr., said there are pros and cons to wind farms. From an energy production standpoint and from an additional revenue source for municipalities, wind turbines are a benefit. However, he said there are those that argue the wind farm changed the character of the rural township by affecting aesthetics. He said in Bear Creek, it seemed once residents caught wind of the turbine project, they had questions and concerns for it but it was too far along in the development process to address some of them. He said residents should come to all public meetings held on wind farm developments early on and be informed of those meetings with ample time. Kresge recommended municipalities to ensure developers go through the proper subdivision and land development process in municipalities and to involve the public early on. \"If there's any recommendation I can give is go through the proper channels,\" he said. \"Go through planning, zoning and public participation. And then at the end of the day if they can demonstrate they can address the concerns of the township regulations I think it could be a positive thing,\" he said. achristman@standardspeaker.com Copyright, 2009, Standard-Speaker, All Rights Reserved. Citation (aglc Style) AMANDA CHRISTMAN, STAFF WRITER, '', Standard-Speaker (online), 28 Dec 2009 1 ‹https://infoweb.newsbank.com/apps/news/document-view? p=WORLDNEWS&docref=news/12CE7E55D4829858› "
}
